package Database;

import Database.MovieRepository.Movie;

import java.util.HashMap;

public class Arrays {

    public static Movie[] movieRepositoryArray = new Movie[]{
            new Movie(
                    "Унесённые призраками",
                    "Аниме",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Ходячий замок",
                    "Аниме",
                    "Полнометражка",
                    2004,
                    "Япония",
                    8.3,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Твоё имя",
                    "Аниме",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Зелёная книга",
                    "Биография",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Поймай меня, если сможешь",
                    "Криминал",
                    "Полнометражка",
                    2002,
                    "США",
                    8.5,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Начало",
                    "Фантастика",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Брат 2",
                    "Боевик",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джанго освобожденный",
                    "Вестерн",
                    "Полнометражка",
                    2012,
                    "США",
                    8.2,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Омерзительная восьмерка",
                    "Вестерн",
                    "Полнометражка",
                    2015,
                    "США",
                    7.9,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "В бой идут одни \"старики\"",
                    "Военный",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.7,
                    "Леонид Быков"
            ),
            new Movie(
                    "Пианист",
                    "Военный",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Спасти рядового Райана",
                    "Военный",
                    "Полнометражка",
                    1998,
                    "США",
                    8.2,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Остров проклятых",
                    "Детектив",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Достать ножи",
                    "Детектив",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Шерлок",
                    "Детектив",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Детский",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Детский",
                    "Мультсериал",
                    2003,
                    "Россия",
                    7.3,
                    "Илья Попов"
            ),
            new Movie(
                    "Фиксики",
                    "Детский",
                    "Мультсериал",
                    2010,
                    "Россия",
                    6.9,
                    "Василий Бедошвили"
            ),
            new Movie(
                    "Романовы",
                    "Документальный",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "Документальный",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Следствие вели",
                    "Документальный",
                    "Сериал",
                    2006,
                    "Россия",
                    7.9,
                    "Дмитрий Докучаев"
            ),
            new Movie(
                    "Зелёная книга",
                    "Драма",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Остров проклятых",
                    "Драма",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Игра",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Игра",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Игра",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Романовы",
                    "История",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "История",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Титаник",
                    "История",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джентельмены",
                    "Комедия",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Комедия",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Бриллиантовая рука",
                    "Комедия",
                    "Полнометражка",
                    1968,
                    "СССР",
                    8.5,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Короткометражка",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Самогонщики",
                    "Короткометражка",
                    "Короткометражка",
                    1962,
                    "СССР",
                    8.3,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Наваждение",
                    "Короткометражка",
                    "Короткометражка",
                    1965,
                    "СССР",
                    8.8,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Джентельмены",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Брат 2",
                    "Криминал",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Достать ножи",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Твоё имя",
                    "Мелодрама",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Титаник",
                    "Мелодрама",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Друзья",
                    "Мелодрама",
                    "Сериал",
                    1994,
                    "США",
                    9.2,
                    "Гари Хэлворсон"
            ),
            new Movie(
                    "Пианист",
                    "Музыка",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Музыка",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэмьен Шазелл"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Мультфильм",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Мультфильм",
                    "Сериал",
                    2003,
                    "Россия",
                    7.3,
                    "Денис Чернов"
            ),
            new Movie(
                    "Холодное сердце",
                    "Мультфильм",
                    "Полнометражка",
                    2013,
                    "США",
                    7.8,
                    "Крис Бак"
            ),
            new Movie(
                    "Алладин",
                    "Мюзикл",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Мюзикл",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэиьен Шазелл"
            ),
            new Movie(
                    "Кошмар перед Рождеством",
                    "Мюзикл",
                    "Полнометражка",
                    1993,
                    "США",
                    8.0,
                    "Генри Селик"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Приключения",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Приключения",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Реальное ТВ",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Реальное ТВ",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Реальное ТВ",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Алладин",
                    "Семейный",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Семейный",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Семейный",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Начало",
                    "Триллер",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Шерлок",
                    "Триллер",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Унесённые призраками",
                    "Фэнтези",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Фэнтези",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Фэнтези",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            )
    };

    public static String[] Category = new String[]{ //0-2
            "фильм", "сериал", "короткометражка"
    };

    public static String[] Country = new String[]{ // 3 - 200
            "австралия", "австрия", "азербайджан", "албания", "алжир",
            "ангола", "андорра", "антарктида", "aргентина", "армения",
            "aруба", "афганистан", "багамы", "бангладеш", "барбадос",
            "бахрейн", "беларусь", "белиз", "бельгия", "бенин",
            "бермуды", "бирма", "болгария", "боливия", "босния",
            "ботсвана", "бразилия", "бруней-даруссалам", "буркина-фасо", "бурунди",
            "бутан", "вануату", "ватикан", "великобритания", "венгрия",
            "венесуэла", "вьетнам", "габон", "гаити", "гайана",
            "гамбия", "гана", "гваделупа", "гватемала", "гвинея",
            "германия", "гибралтар", "гренада", "гренландия", "греция",
            "грузия", "гуам", "дания", "джибути", "доминика",
            "доминикана", "египет", "замбия", "зимбабве", "гондурас",
            "гонконг", "заир", "израиль", "индонезия", "индия",
            "иордания", "ирак", "иран", "ирландия", "исландия",
            "испания", "италия", "йемен", "кабо-верде", "казахстан",
            "камбоджа", "камерун", "канада", "катар", "кения",
            "кипр", "киргизия", "кирибати", "китай", "колумбия",
            "коморы", "конго", "корея", "косово", "коста-рика",
            "кот-д'ивуар", "куба", "кувейт", "лаос", "латвия",
            "лесото", "либерия", "ливан", "ливия", "литва",
            "лихтенштейн", "люксембург", "маврикий", "мавритания", "мадагаскар",
            "макао", "македония", "малави", "малайзия", "мали",
            "мальдивы", "мальта", "марокко", "мартиника", "масаи",
            "мексика", "мозамбик", "молдова", "монако", "монголия",
            "монтсеррат", "мьянма", "намибия", "непал", "нигер",
            "нигерия", "нидерланды", "никарагуа", "норвегия", "оаэ",
            "оман", "кука", "пакистан", "палау", "палестина",
            "панама", "парагвай", "перу", "польша", "португалия",
            "реюньон", "россия", "руанда", "румыния", "сальвадор",
            "самоа", "свазиленд", "сенегал", "сербия", "сиам",
            "сингапур", "сирия", "словакия", "словения", "сомали",
            "ссср", "судан", "суринам", "сша", "сьерра-леоне",
            "таджикистан", "таиланд", "тайвань", "танзания", "тимор-лесте",
            "того", "тонга", "тувалу", "тунис", "туркменистан",
            "турция", "уганда", "узбекистан", "украина", "уругвай",
            "фиджи", "филиппины", "финляндия", "франция", "хорватия",
            "цар", "чад", "черногория", "чехия", "чехословакия",
            "чили", "швейцария", "швеция", "шри-ланка", "эквадор",
            "эритрея", "эстония", "эфиопия", "юар", "югославия",
            "югославия", "ямайка", "япония"
    };

    public static String[] Genre = new String[]{ // 201 - 231
            "комедия", "мультфильм", "ужасы",
            "фантастика", "триллер", "боевик",
            "мелодрама", "детектив", "приключения",
            "фэнтези", "военный", "семейный",
            "аниме", "исторический", "драма",
            "документальный", "детский", "криминал",
            "биография", "вестерн", "фильм-нуар",
            "спорт", "тв",
            "концерт", "музыка", "мюзикл",
            "ток-шоу", "новости", "игра", "церемония"
    };

    public static String[] Director = new String[]{
            "эльдар рязанов", "леонид гайдай", "марк захаров", "станислав ростоцкий", "станислав говорухин", "игорь масленников",
            "георгий юнгвальд-хилькевич", "вениамин дорман", "ян фрид", "владимир бортко", "георгий данелия",
            "алла сурикова", "сергей бондарчук", "татьяна лиознова", "роберт земекис", "франсис вебер",
            "леонид быков", "андрей тарковский", "юрий чулюкин", "александр павловский", "михаил швейцер",
            "константин бромберг", "евгений татарский", "владимир меньшов", "жерар ури", "александр серый",
            "михаил козаков", "кастеллано и пиполо", "евгений ташков", "евгений карелов", "владимир мотыль",
            "александр роу", "стэнли кубрик", "александр рогожкин", "леонид квинихидзе", "григорий александров",
            "эдуар молинаро", "надежда кошеверова", "эдмонд кеосаян", "григорий чухрай", "жан жиро",
            "николай калинин", "владимир фетин", "федерико феллини", "алексей балабанов", "лукино висконти",
            "никита михалков", "карен шахназаров", "марлен хуциев", "феликс миронер", "иван пырьев",
            "питер джексон", "ежи гофман", "франко проспери", "эльдар рязанов", "андрэ юнебель",
            "сергей урсуляк", "василий шукшин", "ив робер", "франко кастеллано", "джузеппе моччиа",
            "владимир воробьёв", "александр птушко", "джеймс кэмерон", "тим бёртон", "геральд бежанов",
            "элем климов", "стивен спилберг", "крис коламбус", "валерий усков", "владимир краснопольский",
            "милош форман", "алексей коренев", "фрэнсис форд коппола", "виталий мельников", "андрей тутышкин",
            "семен тимошенко", "наум бирман", "бернардо бертолуччи", "юлиуш махульский", "клод зиди",
            "михаил калатозов", "ларс фон триер", "андрей малюков", "микеланджело антониони", "александр алов",
            "владимир наумов", "александр митта", "дэвид финчер", "сергей герасимов", "владимир роговой",
            "анатолий граник", "виктор макаров", "александр полынников", "светлана дружинина", "серж корбер",
            "владимир басов", "ридли скотт", "роман полански", "александр зархи", "эмир кустурица",
            "александр прошкин", "фёдор хитрук", "рамеш сипи", "мэл гибсон", "александр муратов",
            "борис степанов", "вячеслав никифоров", "геннадий иванов", "олег фомин", "джерри цукер",
            "уильям уайлер", "сидни поллак", "лассе халльстрём", "эльдор уразбаев", "джон бэдэм",
            "жерар пирес", "вацлав ворличек", "алехандро гонсалес иньярриту", "григорий кохан", "григорий козинцев",
            "ингмар бергман", "альфред форер", "дино ризи", "харольд рамис", "андрей смирнов",
            "альберт мкртчян", "леонид попов", "генрих оганесян", "квентин тарантино", "надежда кошеверов",
            "михаил шапиро", "ярополк лапшин", "виктор храмов", "валентин плучек", "самвел гаспаров",
            "андре юнебель", "жерар кравчик", "кристиан жак", "льюис тиг", "владимир вайншток",
            "джон корнелл", "альфред хичкок", "самсон самсонов", "джек бендер", "стивен уильямс",
            "геннадий полока", "павел арсенов", "серджио леоне", "питер файман", "геннадий казанский",
            "владимир чеботарёв", "леонид нечаев", "виктор трегубович", "олег бондарев", "оливер стоун",
            "михаил ромм", "серджио корбуччи", "константин воинов", "андрей кончаловский", "джулиан эмис",
            "люк бессон", "билли уайлдер", "вуди аллен", "акира куросава", "бернар бордери",
            "константин ершов", "георгий кропачев", "александр птушко", "сергей эйзенштейн", "робер энрико",
            "чарли чаплин", "геннадий казанский", "иван лукинский", "павел лунгин", "джордж даннинг",
            "аркадий райкин", "виктор храмов", "пётр тодоровский", "ролан быков", "жорж лотнер",
            "виктор иванов", "юрий норштейн", "константин юдин", "фрэнк дарабонт", "мартин скорсезе",
            "франко дзеффирелли", "вольфганг петерсен", "гарри маршалл", "пьер паоло пазолини", "серджо корбуччи",
            "лев кулиджанов", "виктор флеминг", "джордж кьюкор", "сэм вуд", "дмитрий дьяченко",
            "том шедьяк", "вадим абдрашитов", "глеб панфилов", "роберто бениньи", "блэйк эдвардс",
            "кэтрин бигелоу", "александр файнциммер", "александр иванов", "юлий гусман", "динара асанова",
            "давид черкасский", "саймон лэнгтон", "виллен азаров", "олег кузовков", "олег ужинов",
            "денис червяцов", "юлий райзман", "юрий озеров", "борис равенских", "татьяна лукашевич",
            "николай досталь", "андрей тутышкин", "сергей микаэлян", "михаил царёв", "василий левин",
            "вернер херцог", "гор вербински", "валерий рубинчик", "братья коэн", "михаил юзовский",
            "александр столпер", "борис иванов", "джоэл шумахер", "александр ивановский", "надежда кошеверова",
            "инесса ковалевская", "александр белинский", "алан тейлор", "алекс грейвз", "даниэль минахан",
            "гай ричи", "абрам народицкий", "николай рашеев", "борис рыцарев", "виктор титов",
            "леонид луков", "резо чхеидзе", "джозеф манкевич", "вячеслав котёночкин", "герберт раппапорт",
            "жак дере", "лев атаманов", "фёдор хитрук", "геннадий сокольский", "сергей соловьев",
            "майк ньюэлл", "джей ли томпсон", "роман абелевич качанов", "энтони мингелла", "борис степанцев",
            "филипп де брока", "семён аранович", "борис дуров", "григорий рошаль", "александр татарский",
            "джонатан демми", "александр столпер", "михаил жаров", "рихард грошопп", "луи де фюнес",
            "майкл леманн", "стэнли крамер", "тэйлор хэкфорд", "питер уир", "сергей сиделев",
            "вячеслав бровкин", "юрий кротенко", "геннадий павлов", "василий давидчук", "джим джармуш",
            "эдуард назаров", "владимир назаров", "джаник файзиев", "григорий козинцев", "леонид трауберг",
            "такеши китано", "кристофер нолан", "ричард левинсон", "уильям линк", "роман давыдов",
            "лариса шепитько", "витторио де сика", "владимир попков", "вим вендерс", "саймон уинсер",
            "александр бурцев", "илья макаров", "михаил вассербаум", "юрий музыка", "владимир фокин",
            "николай литус", "алексей мишурин", "евгений матвеев", "альфонсо куарон", "владимир попов",
            "игорь усов", "оберт родригес", "семен деревянский", "рафаил суслович", "джон тёртелтауб",
            "мартин брест", "фрэнк оз", "янис стрейч", "иосиф хейфиц", "эмиль ардолино",
            "мартин кэмпбелл", "нэнси мейерс", "клод лелуш", "лана вачовски", "лилли вачовски",
            "ирма рауш", "коки гидройк", "никита курихин", "теодор вульфович", "валерий кремнев",
            "вадим дербенёв", "луис бунюэль", "барри левинсон", "роман балаян", "орсон уэллс",
            "тони скотт", "алан паркер", "джон гиллермин", "гавриил егиазаров", "даниил храбровицкий",
            "джузеппе торнаторе", "виктор ивченко", "алексей герман", "савва кулиш", "дэвид линч",
            "айван райтман", "алоиз бренч", "игорь добролюбов", "аллан аркуш", "сэм уайзмен",
            "джералд перри финнерман", "владимир петров", "лев цуцульковский", "пэт о'коннор", "стивен фрирз",
            "дмитрий киселев", "татьяна лукашевич", "михаил ромм", "дмитрий васильев", "андре мишель",
            "даррен аронофски", "владимир герасимов", "николай литус", "виталий шунько", "виктор эйсымонт",
            "холл бартлетт", "виктор сергеев", "альберт мкртчян", "джейн кэмпион", "брайан де пальма",
            "исидор анненский", "джо райт", "юлий карасик", "жак деми", "эндрю стэнтон",
            "зиновий ройзман", "марк гриффитс", "сидни хайерс", "александр столбов", "павел любимов",
            "андрей звягинцев", "клим шипенко", "жан-пьер жёне", "леонид филатов", "анна матисон",
            "натан юран", "владимир басов", "ольга басова", "искра бабич", "иэн софтли",
            "марлен хуциев", "геннадий байсак", "флориан хенкель фон доннерсмарк", "юрий кара", "майкл бэ",
            "роланд эммерих", "роб маршалл", "арунас жебрюнас", "майкл манн", "боб рафелсон",
            "вячеслав никифоров", "илья гурин", "александр птушко", "дамир вятич-бережных", "всеволод пудовкин",
            "михаил доллер", "артур хиллер", "валентин плучек", "григорий аронов", "николай иванович лебедев",
            "эрнес ясан", "александр галин", "александр бланк", "сергей линков", "андрей фролов",
            "ксавье жанс", "андрей разенков", "рон ховард", "александр ивановский", "роберто росселлини",
            "павел чухрай", "кевин смит", "сергей ашкенази", "джон ву", "алексей сахаров",
            "ник кассаветис", "григорий липшиц", "анатолий резников", "дэнни бойл", "терри гиллиам",
            "алексей праздников", "сергей басин", "кирилл капица", "дмитрий месхиев", "валерий тодоровский",
            "земан борживой", "дамиано дамиани", "флорестано ванчини", "луиджи перелли", "оливье накаш",
            "эрик толедано", "александр котт", "пол верховен", "валерий ахадов", "анатолий бобровский",
            "кевин рейнолдс", "пётр фоменко", "бретт ратнер", "алехандро аменабар", "гас ван сент",
            "дэвид фрэнкел", "юрий мамин", "роджер аллерс", "роб минкофф", "шэрон магуаер",
            "анна меликян", "тим роббинс", "нора эфрон", "василий ордынский", "михаил агранович",
            "олег янковский", "гэрри маршалл", "александра снежко-блоцкая", "василий ливанов", "аида зябликова",
            "николай лебедев", "рудольф мате", "владимир стрелков", "михалис какояннис", "баббар субхаш",
            "джон мэдден", "маршалл херсковиц", "юрий борецкий", "владимир полковников", "александра снежко-блоцкая",
            "валерий рыбарёв", "игорь апасян", "пьетро франчиши", "джон кёрран", "павел пархоменко",
            "рассел малкэхи", "софи коппола", "братья фарелли", "владимир беренштейн", "илья гурин",
            "леонид луков", "рене клеман", "джозеф барбера", "уильям ханна", "рудольф исинг",
            "игорь ильинский", "юрий сааков", "джерими ливен", "виталий иванов", "михаил жаров",
            "джордж миллер", "рашид нугманов", "паскуале феста кампаниле", "нил джордан", "роже вадим",
            "георгий шенгелия", "джон лэндис	", "кира муратова", "стивен долдри", "нейл бергер",
            "александр бланк", "линдсей андерсон", "владимир хотиненко", "тед демме", "брюс робинсон",
            "тепцов олег", "барри зонненфельд", "боб фосс", "илья фрэз", "владимир чеботарев",
            "александр боголюбов", "педро альмодовар", "анатолий эфрос", "джордж кьюкор", "даг лайман",
            "борис бунеев", "алексей праздников", "филипп кауфман", "жан-жак анно", "ариэль зейтун",
            "эрик бресс", "томас ян", "франсуа озон", "джеремайя чечик", "питер уэллер",
            "джонатан линн", "джон мактирнан", "иван иванов-вано", "борис бутаков",
            "денис чернов", "василий пичул", "тигран кеосаян", "билле аугуст", "наум трахтенберг",
            "пьетро джерми", "ким мэннерс", "роб боумен", "дэвид наттер", "эмиль лотяну",
            "джон франкенхаймер", "дэвид кепп", "джонни депп", "дмитрий астрахан", "кевин костнер",
            "марк форстер", "георгий данелия", "игорь таланкин", "дэвид йейтс", "хаяо миядзаки",
            "м. найт шьямалан", "сергей колосов", "павел клушанцев", "клинт иствуд", "роберт маллиган",
            "джеймс брукс", "брайан персивал", "боб гейл", "витаутас жалакявичюс", "лоуренс данмор",
            "игорь таланкин", "чак рассел", "артур пенн", "роуди херрингтон", "кеннет брана",
            "борис степанов", "ричард брукс", "лоуренс кэздан", "радомир василевский", "семён туманов",
            "альберт хьюз", "аллен хьюз", "клод берри", "йос стеллинг", "гари виник",
            "питер гринуэй", "мишель хазанавичус", "владимир довгань", "майк николс", "анн фонтен",
            "мира наир", "патрис леконт", "шекхар капур", "ефрем пружанский", "роланд жоффе",
            "бибан кидрон", "пенни маршалл", "дени аркан", "марк орлов", "мохан сегал",
            "карен оганесян", "константин худяков", "фернандо гонзалез молина", "антон мегердичев", "рэндал клайзер",
            "наум ардашников", "олег ефремов", "виллен новак", "виктор гресь", "юрий егоров",
            "салли поттер", "дуэт вачовски", "том тыквер", "эндрю адамсон", "вики дженсон",
            "рэнд рэвич", "элисон андерс", "александр рокуэлл", "роберт родригес", "квентин тарантино",
            "максим руф", "николай игоревич лебедев", "джо джонстон", "владимир бычков", "яков протазанов",
            "оливер паркер", "алехандро агрести", "дамиано дамиани", "элиа казан", "николай экк",
            "эдуард абалов", "джейми юис", "роберт бентон", "владимир алеников",
            "мишель гондри", "стив маккуин", "стивен соммерс", "гарт дженнингс", "пол андерсон",
            "баз лурман", "филипп нойс", "майкл чимино", "юрий дубровин", "стивен содерберг",
            "ричард кёртис", "родион нахапетов", "владимир грамматиков", "сергей евлахишвили", "александр петров",
            "алексей салтыков", "ричард викторов", "сергей мирошниченко", "леонид гайдай", "ристо орко",
            "уэс андерсон", "александр лейманис", "лоне шерфиг", "энг ли", "лучано сальче",
            "нери паренти", "александр сокуров", "чак воркман", "габриэль муччино", "роберт хармон",
            "иштван сабо", "киаран доннелли", "джереми подесва", "дирбла уолш", "ким мэннерс",
            "билл коркоран", "джеймс уитмор мл", "роман качанов", "майкл эптид", "аллен култер",
            "алан по", "мика каурисмяки", "кит фултон", "луис пепе", "игорь таланкин",
            "дмитрий таланкин", "винсент уорд", "иван иванов-вано", "александра снежко-блоцкая", "майк николс",
            "анджей вайда", "дэвид линч", "марк фрост", "роберт уайз", "дэрил дьюк",
            "николай литус", "иван симоненко", "юлиан шнабель", "гильермо дель торо", "иван иванов-вано",
            "лев мильчин", "ричард доннер", "ренни харлин", "режис варнье", "джон бурмен",
            "эндрю никкол", "гарри бардин", "вера сторожева", "илья ольшвангер", "эдриан лайн",
            "лев кулиджанов", "яков сегель", "джеймс мактиг", "джим о'брайэн", "майкл кёртис",
            "михаил цехановский", "джон эрман", "том хупер", "фрунзе довлатян", "лев мирский",
            "дэвид блэр", "владимир попов", "кёртис хэнсон", "роб райнер", "дэвид хэнд",
            "натан грено", "байрон ховард", "джон уотерс", "пол хаггис", "аян шахмалиева",
            "валерий приёмыхов", "джон лассетер", "жан кершброн", "джордж лукас", "аки каурисмяки",
            "лев голуб", "виктор георгиев", "бен стиллер", "брайан сингер", "трей паркер",
            "мэтт стоун", "эндрю адамсон", "эдриан лайн", "михаэль ханеке", "жако ван дормель",
            "федор петрухин", "эльёр ишмухамедов", "григорий кроманов", "пак чхан ук", "владимир дахно",
            "александр итыгилов", "пол томас андерсон", "терренс малик", "инесса селезнева", "гарик сукачёв",
            "фрэнк миллер", "роберт родригес", "квентин тарантино", "вадим злoбин", "mapк opлoв",
            "лeoнид пчeлкин", "шухрат аббасов", "антон барщевский", "майкл мур", "атом эгоян",
            "николас рэй", "станислав говорухин", "борис дуров", "джон макнотон", "дэвид шор",
            "луи летерье", "джим о'хенлон", "фрэнк маршалл", "агаси бабаян", "борис дёжкин",
            "роберт олтман", "георгий калатозишвили", "геннадий васильев", "михаил калик", "эдвард цвик",
            "мими ледер", "киёси нишимура", "сергей соловьев", "оксана бычкова", "джон хаф",
            "лени рифеншталь", "гэри трусдейл", "бертран блие", "сергей тарасов", "джон майкл макдонах",
            "фрэнсис лоуренс", "болотбек шамшиев", "борис бунеев", "сергей данилин", "евгений татарский",
            "ричард лагравенес", "мария федорова", "ричард линклейтер", "крис сандерс", "дин деблуа",
            "франсуа трюффо", "хасан хажкасимов", "николай иванович лебедев", "борис букреев", "михаил ульянов",
            "иван иванов-вано", "люк жаке", "александр аравин", "владимир македонский", "дэн зэфф",
            "марк манден", "витольд адамек", "сурен шахбазян", "феликс миронер", "антуан фукуа",
            "алексей сидоров", "мики стаменкович", "ян кунен", "тимофей левчук", "константин ершов",
            "генри сафран", "владимир машков", "сергей гинзбург", "дэвид карсон", "херберт уайз",
            "алексей симонов", "тиль швайгер", "василий пронин", "ходжа аббас", "уолтер хилл",
            "эмир кустурица", "спайк ли", "джон ву", "ридли скотт", "андрей яковлев",
            "анна гресь", "вадим зобин", "крис картер"
    };

    public static String[] Lastname = { //232 - 943
            "мотыль", "мактиг", "анненский", "иванов-вано", "маллиган", "протазанов",
            "сегель", "гриффитс", "леоне", "ильинский", "пружанский",
            "джармуш", "говорухин", "альмодовар", "рошаль", "карсон",
            "дружинина", "роговой", "проспери", "дьюк", "быков",
            "петров", "кубрик", "басова", "яковлев", "аллен",
            "накаш", "исинг", "мэдден", "игоревич", "гурин",
            "хэнд", "бабич", "дере", "ян", "брукс",
            "швайгер", "серый", "ромм", "фрэнкел", "абдрашитов",
            "усков", "рейнолдс", "гинзбург", "юран", "павлов",
            "бондарчук", "равенских", "поллак", "петерсен", "хажкасимов",
            "линклейтер", "белинский", "итыгилов", "шапиро", "кепп",
            "opлoв", "форер", "козинцев", "адамсон", "бондарев",
            "шедьяк", "роу", "юзовский", "звягинцев", "аугуст",
            "месхиев", "кошеверов", "селезнева", "эфрон", "арсенов",
            "коламбус", "македонский", "балаян", "нугманов", "захаров",
            "о'коннор", "сегал", "бунеев", "руф", "мирский",
            "нолан", "стоун", "нечаев", "стэнтон",
            "масленников", "маршалл", "сингер", "кар", "меликян",
            "найт", "мирошниченко", "нахапетов", "карасик", "котт",
            "воробьёв", "бертолуччи", "шипенко", "калатозишвили", "грошопп",
            "файзиев", "лассетер", "фомин", "жанс", "вендерс",
            "деми", "демме", "куарон", "фокин", "софтли",
            "сахаров", "кошеверова", "фукуа", "эммерих", "антониони",
            "лэндис	", "висконти", "макаров", "михалков", "линн",
            "наир", "бабаян", "моччиа", "трауберг", "александров",
            "иванов", "гондри", "шнабель", "олег", "котёночкин",
            "бордери", "наумов", "манден", "херрингтон", "лапшин",
            "юнгвальд-хилькевич", "дербенёв", "муччино", "стиллер", "торнаторе",
            "иванович", "робер", "вуд", "данелия", "минахан",
            "ардолино", "смирнов", "хаггис", "трусдейл", "карелов",
            "эмис", "бергер", "рифеншталь", "абалов", "фонтен",
            "гайдай", "праздников", "хотиненко", "барщевский", "линков",
            "махульский", "мэннерс", "цехановский", "герман", "левин",
            "хэнсон", "попков", "сиделев", "доллер", "аронофски",
            "литус", "аркуш", "кеосаян", "даннинг", "уэллер",
            "рокуэлл", "де", "дженсон", "миядзаки", "ужинов",
            "кэздан", "приёмыхов", "варнье", "левинсон", "ховард",
            "уолш", "урсуляк", "грено", "грамматиков", "тёртелтауб",
            "ольшвангер", "лурман", "кёртис", "царёв", "оганесян",
            "климов", "гофман", "викторов", "агрести", "орлов",
            "франкенхаймер", "рэй", "райкин", "николс",
            "бресс", "клушанцев", "гибсон", "леманн", "озон",
            "коренев", "ву", "худяков", "цвик", "ясан",
            "никифоров", "казанский", "кауфман", "ризи", "наттер",
            "герасимов", "довгань", "по", "давыдов", "машков",
            "тарасов", "зиди", "плучек", "самсонов", "ефремов",
            "сабо", "фоменко", "муратова", "георгиев", "аменабар",
            "джерми", "боголюбов", "калинин", "херцог", "о'брайэн",
            "казан", "мельников", "уильямс", "вятич-бережных", "майкл",
            "кулиджанов", "зобин", "клеман", "тутышкин", "херсковиц",
            "шепитько", "уайз", "барбера", "соловьев", "мишель",
            "аранович", "жиро", "шахназаров", "музыка", "магуаер",
            "миллер", "хэкфорд", "швейцер", "роббинс", "салтыков",
            "кэмерон", "фрид", "райнер", "доннелли", "лукас",
            "чернов", "анно", "воинов", "жаров", "рубинчик",
            "агранович", "лукашевич", "злoбин", "гаспаров", "козаков",
            "соммерс", "сипи", "аравин", "тодоровский", "маккуин",
            "лагравенес", "пепе", "верховен", "бобровский", "земекис",
            "чеботарев", "балабанов", "кьюкор", "капур", "филатов",
            "лунгин", "резников", "жалакявичюс", "жоффе", "бардин",
            "жак", "райт", "тыквер", "смит", "новак",
            "рэвич", "скорсезе", "тиг", "брана", "куросава",
            "фрэз", "таланкин", "фон", "снежко-блоцкая", "линч",
            "разенков", "халльстрём", "оз", "данмор", "василевский",
            "скотт", "туманов", "симоненко", "лоуренс", "хенкель",
            "петрухин", "зэфф", "цукер", "аббас", "хьюз",
            "данилин", "хазанавичус", "гидройк", "картер", "субхаш",
            "аркан", "бурцев", "мегердичев", "мишурин", "лейманис",
            "бычкова", "ричи", "титов", "гонсалес", "апасян",
            "пирес", "асанова", "китано", "рауш", "лайн",
            "джордан", "бениньи", "бурмен", "полынников", "бирман",
            "уразбаев", "мамин", "рыцарев", "норштейн", "алов",
            "лэнгтон", "степанов", "вачовски", "аббасов", "манкевич",
            "сурикова", "форд", "бежанов", "дзеффирелли", "мкртчян",
            "хейфиц", "трахтенберг", "чхан", "депп", "кастеллано",
            "экк", "кэмпион", "бэдэм", "квинихидзе", "бунюэль",
            "рашеев", "колосов", "егоров", "вассербаум", "кузовков",
            "финчер", "бровкин", "паренти", "шамшиев", "матвеев",
            "червяцов", "фролов", "доннер", "рогожкин", "шумахер",
            "эгоян", "кравчик", "андерс", "муратов",
            "уитмор", "сааков", "ливен", "галин", "ивченко",
            "кершброн", "гринуэй", "тейлор", "эфрос", "рассел",
            "гресь", "хитрук", "фарелли", "мильчин", "хилл",
            "капица", "федорова", "гонзалез", "дамиани", "ульянов",
            "эрман", "пырьев", "манн", "евлахишвили", "линк",
            "райзман", "ледер", "черкасский", "йейтс", "сальче",
            "вульфович", "рафелсон", "хиллер", "шенгелия", "летерье",
            "ван", "столпер", "ардашников", "полока", "ратнер",
            "дубровин", "хуциев", "борживой", "джонстон", "сафран",
            "лукинский", "коппола", "блэр", "жебрюнас", "ройзман",
            "назаров", "эйзенштейн", "кремнев", "хайерс", "каурисмяки",
            "мингелла", "крамер", "родригес", "народицкий", "томас",
            "франчиши", "пронин", "макки", "макнотон", "нойс",
            "прошкин", "панфилов", "вайда", "трюффо", "байсак",
            "кроманов", "толедано", "виник", "феллини", "перелли",
            "бергман", "малик", "янковский", "басин", "паоло",
            "кассаветис", "деревянский", "уинсер", "ивановский", "ахадов",
            "абелевич", "кулиш", "тарковский", "ташков", "деблуа",
            "миронер", "юдин", "луков", "голуб", "краснопольский",
            "сандерс", "меньшов", "андерсон", "лебедев",
            "шахмалиева", "долдри", "сокольский", "пенн", "лиознова",
            "кэмпбелл", "энрико", "бентон", "татарский", "бартлетт",
            "дель", "файнциммер", "озеров", "хаф", "чеботарёв",
            "букреев", "култер", "уорд", "леконт", "содерберг",
            "ури", "зябликова", "джексон", "кидрон",
            "коркоран", "птушко", "сергеев", "столбов", "какояннис",
            "сукачёв", "корбер", "фрост", "курихин", "костнер",
            "стеллинг", "уотерс", "ростоцкий", "бессон", "сторожева",
            "довлатян", "киселев", "уэллс", "флеминг", "гиллиам",
            "пичул", "ордынский", "о'хенлон", "пудовкин", "чхеидзе",
            "бренч", "липшиц", "рамис", "васильев", "рязанов",
            "бутаков", "рыбарёв", "лотяну", "кара", "эйсымонт",
            "ванчини", "бортко", "боумен", "молинаро", "шор",
            "ишмухамедов", "дуров", "бланк", "дёжкин", "стаменкович",
            "малюков", "азаров", "микаэлян", "алеников", "корбуччи",
            "бигелоу", "гусман", "никкол", "пархоменко", "пчeлкин",
            "юис", "персивал", "храбровицкий", "раппапорт", "митта",
            "зархи", "эптид", "форман", "корнелл", "трегубович",
            "бычков", "дженнингс", "перри", "сидоров", "жаке",
            "полански", "гейл", "орко", "ковалевская", "поттер",
            "вайншток", "фосс", "дорман", "чухрай", "ашкенази",
            "вадим", "чаплин", "стрейч", "иствуд", "фрирз",
            "кунен", "росселлини", "адамек", "степанцев", "демми",
            "жёне", "нишимура", "калатозов", "усов", "бёртон",
            "хичкок", "эдвардс", "грейвз", "брест", "сокуров",
            "тарантино", "матисон", "ершов", "хупер", "райтман",
            "мате", "лелуш", "беренштейн", "тимошенко", "атаманов",
            "гиллермин", "харлин", "блие", "минкофф", "досталь",
            "бэ", "уир", "юнебель", "шахбазян", "кустурица",
            "паркер", "аллерс", "олтман", "полковников", "фетин",
            "добролюбов", "ханна", "цуцульковский", "астрахан", "бромберг",
            "мактирнан", "кохан", "лайман", "граник", "коэн",
            "ли", "симонов", "суслович", "шукшин", "спилберг",
            "файман", "воркман", "давидчук", "уайзмен", "ньюэлл",
            "ливанов", "уайлер", "борецкий", "клайзер", "подесва",
            "мур", "аронов", "форстер", "дьяченко", "шерфиг",
            "качанов", "кротенко", "чимино", "бендер", "егиазаров",
            "павловский", "вебер", "малкэхи", "робинсон", "левчук",
            "кёрран", "стрелков", "бойл", "лотнер", "мейерс",
            "дахно", "попов", "вербински", "любимов", "феста",
            "басов", "храмов", "кропачев", "уайлдер", "берри",
            "фултон", "ворличек", "кончаловский", "ханеке", "зонненфельд",
            "калик", "хармон", "шунько", "дарабонт"
    };

        public static HashMap<String, String> DirectorDictionary = new HashMap<>() {{
                put("рязанов", "эльдар");
                put("гайдай", "леонид");
                put("захаров", "марк");
                put("ростоцкий", "станислав");
                put("говорухин", "станислав");
                put("масленников", "игорь");
                put("юнгвальд-хилькевич", "георгий");
                put("дорман", "вениамин");
                put("фрид", "ян");
                put("бортко", "владимир");
                put("данелия", "георгий");
                put("сурикова", "алла");
                put("бондарчук", "сергей");
                put("лиознова", "татьяна");
                put("земекис", "роберт");
                put("вебер", "франсис");
                put("быков", "леонид");
                put("тарковский", "андрей");
                put("чулюкин", "юрий");
                put("павловский", "александр");
                put("швейцер", "михаил");
                put("бромберг", "константин");
                put("татарский", "евгений");
                put("меньшов", "владимир");
                put("ури", "жерар");
                put("серый", "александр");
                put("козаков", "михаил");
                put("и пиполо", "кастеллано");
                put("ташков", "евгений");
                put("карелов", "евгений");
                put("мотыль", "владимир");
                put("роу", "александр");
                put("кубрик", "стэнли");
                put("рогожкин", "александр");
                put("квинихидзе", "леонид");
                put("александров", "григорий");
                put("молинаро", "эдуар");
                put("кошеверова", "надежда");
                put("кеосаян", "эдмонд");
                put("чухрай", "григорий");
                put("жиро", "жан");
                put("калинин", "николай");
                put("фетин", "владимир");
                put("феллини", "федерико");
                put("балабанов", "алексей");
                put("висконти", "лукино");
                put("михалков", "никита");
                put("шахназаров", "карен");
                put("хуциев", "марлен");
                put("миронер", "феликс");
                put("пырьев", "иван");
                put("джексон", "питер");
                put("гофман", "ежи");
                put("проспери", "франко");
                put("рязанов", "эльдар");
                put("юнебель", "андрэ");
                put("урсуляк", "сергей");
                put("шукшин", "василий");
                put("робер", "ив");
                put("кастеллано", "франко");
                put("моччиа", "джузеппе");
                put("воробьёв", "владимир");
                put("птушко", "александр");
                put("кэмерон", "джеймс");
                put("бёртон", "тим");
                put("бежанов", "геральд");
                put("климов", "элем");
                put("спилберг", "стивен");
                put("коламбус", "крис");
                put("усков", "валерий");
                put("краснопольский", "владимир");
                put("форман", "милош");
                put("коренев", "алексей");
                put("форд коппола", "фрэнсис");
                put("мельников", "виталий");
                put("тутышкин", "андрей");
                put("тимошенко", "семен");
                put("бирман", "наум");
                put("бертолуччи", "бернардо");
                put("махульский", "юлиуш");
                put("зиди", "клод");
                put("калатозов", "михаил");
                put("фон триер", "ларс");
                put("малюков", "андрей");
                put("антониони", "микеланджело");
                put("алов", "александр");
                put("наумов", "владимир");
                put("митта", "александр");
                put("финчер", "дэвид");
                put("герасимов", "сергей");
                put("роговой", "владимир");
                put("граник", "анатолий");
                put("макаров", "виктор");
                put("полынников", "александр");
                put("дружинина", "светлана");
                put("корбер", "серж");
                put("басов", "владимир");
                put("скотт", "ридли");
                put("полански", "роман");
                put("зархи", "александр");
                put("кустурица", "эмир");
                put("прошкин", "александр");
                put("хитрук", "фёдор");
                put("сипи", "рамеш");
                put("гибсон", "мэл");
                put("муратов", "александр");
                put("степанов", "борис");
                put("никифоров", "вячеслав");
                put("иванов", "геннадий");
                put("фомин", "олег");
                put("цукер", "джерри");
                put("уайлер", "уильям");
                put("поллак", "сидни");
                put("халльстрём", "лассе");
                put("уразбаев", "эльдор");
                put("бэдэм", "джон");
                put("пирес", "жерар");
                put("ворличек", "вацлав");
                put("гонсалес иньярриту", "алехандро");
                put("кохан", "григорий");
                put("козинцев", "григорий");
                put("бергман", "ингмар");
                put("форер", "альфред");
                put("ризи", "дино");
                put("рамис", "харольд");
                put("смирнов", "андрей");
                put("мкртчян", "альберт");
                put("попов", "леонид");
                put("оганесян", "генрих");
                put("тарантино", "квентин");
                put("кошеверов", "надежда");
                put("шапиро", "михаил");
                put("лапшин", "ярополк");
                put("храмов", "виктор");
                put("плучек", "валентин");
                put("гаспаров", "самвел");
                put("юнебель", "андре");
                put("кравчик", "жерар");
                put("жак", "кристиан");
                put("тиг", "льюис");
                put("вайншток", "владимир");
                put("корнелл", "джон");
                put("хичкок", "альфред");
                put("самсонов", "самсон");
                put("бендер", "джек");
                put("уильямс", "стивен");
                put("полока", "геннадий");
                put("арсенов", "павел");
                put("леоне", "серджио");
                put("файман", "питер");
                put("казанский", "геннадий");
                put("чеботарёв", "владимир");
                put("нечаев", "леонид");
                put("трегубович", "виктор");
                put("бондарев", "олег");
                put("стоун", "оливер");
                put("ромм", "михаил");
                put("корбуччи", "серджио");
                put("воинов", "константин");
                put("кончаловский", "андрей");
                put("эмис", "джулиан");
                put("бессон", "люк");
                put("уайлдер", "билли");
                put("аллен", "вуди");
                put("куросава", "акира");
                put("бордери", "бернар");
                put("ершов", "константин");
                put("кропачев", "георгий");
                put("птушко", "александр");
                put("эйзенштейн", "сергей");
                put("энрико", "робер");
                put("чаплин", "чарли");
                put("казанский", "геннадий");
                put("лукинский", "иван");
                put("лунгин", "павел");
                put("даннинг", "джордж");
                put("райкин", "аркадий");
                put("храмов", "виктор");
                put("тодоровский", "пётр");
                put("быков", "ролан");
                put("лотнер", "жорж");
                put("иванов", "виктор");
                put("норштейн", "юрий");
                put("юдин", "константин");
                put("дарабонт", "фрэнк");
                put("скорсезе", "мартин");
                put("дзеффирелли", "франко");
                put("петерсен", "вольфганг");
                put("маршалл", "гарри");
                put("паоло пазолини", "пьер");
                put("корбуччи", "серджо");
                put("кулиджанов", "лев");
                put("флеминг", "виктор");
                put("кьюкор", "джордж");
                put("вуд", "сэм");
                put("дьяченко", "дмитрий");
                put("шедьяк", "том");
                put("абдрашитов", "вадим");
                put("панфилов", "глеб");
                put("бениньи", "роберто");
                put("эдвардс", "блэйк");
                put("бигелоу", "кэтрин");
                put("файнциммер", "александр");
                put("иванов", "александр");
                put("гусман", "юлий");
                put("асанова", "динара");
                put("черкасский", "давид");
                put("лэнгтон", "саймон");
                put("азаров", "виллен");
                put("кузовков", "олег");
                put("ужинов", "олег");
                put("червяцов", "денис");
                put("райзман", "юлий");
                put("озеров", "юрий");
                put("равенских", "борис");
                put("лукашевич", "татьяна");
                put("досталь", "николай");
                put("тутышкин", "андрей");
                put("микаэлян", "сергей");
                put("царёв", "михаил");
                put("левин", "василий");
                put("херцог", "вернер");
                put("вербински", "гор");
                put("рубинчик", "валерий");
                put("коэн", "братья");
                put("юзовский", "михаил");
                put("столпер", "александр");
                put("иванов", "борис");
                put("шумахер", "джоэл");
                put("ивановский", "александр");
                put("кошеверова", "надежда");
                put("ковалевская", "инесса");
                put("белинский", "александр");
                put("тейлор", "алан");
                put("грейвз", "алекс");
                put("минахан", "даниэль");
                put("ричи", "гай");
                put("народицкий", "абрам");
                put("рашеев", "николай");
                put("рыцарев", "борис");
                put("титов", "виктор");
                put("луков", "леонид");
                put("чхеидзе", "резо");
                put("манкевич", "джозеф");
                put("котёночкин", "вячеслав");
                put("раппапорт", "герберт");
                put("дере", "жак");
                put("атаманов", "лев");
                put("хитрук", "фёдор");
                put("сокольский", "геннадий");
                put("соловьев", "сергей");
                put("ньюэлл", "майк");
                put("ли томпсон", "джей");
                put("абелевич качанов", "роман");
                put("мингелла", "энтони");
                put("степанцев", "борис");
                put("де брока", "филипп");
                put("аранович", "семён");
                put("дуров", "борис");
                put("рошаль", "григорий");
                put("татарский", "александр");
                put("демми", "джонатан");
                put("столпер", "александр");
                put("жаров", "михаил");
                put("грошопп", "рихард");
                put("де фюнес", "луи");
                put("леманн", "майкл");
                put("крамер", "стэнли");
                put("хэкфорд", "тэйлор");
                put("уир", "питер");
                put("сиделев", "сергей");
                put("бровкин", "вячеслав");
                put("кротенко", "юрий");
                put("павлов", "геннадий");
                put("давидчук", "василий");
                put("джармуш", "джим");
                put("назаров", "эдуард");
                put("назаров", "владимир");
                put("файзиев", "джаник");
                put("козинцев", "григорий");
                put("трауберг", "леонид");
                put("китано", "такеши");
                put("нолан", "кристофер");
                put("левинсон", "ричард");
                put("линк", "уильям");
                put("давыдов", "роман");
                put("шепитько", "лариса");
                put("де сика", "витторио");
                put("попков", "владимир");
                put("вендерс", "вим");
                put("уинсер", "саймон");
                put("бурцев", "александр");
                put("макаров", "илья");
                put("вассербаум", "михаил");
                put("музыка", "юрий");
                put("фокин", "владимир");
                put("литус", "николай");
                put("мишурин", "алексей");
                put("матвеев", "евгений");
                put("куарон", "альфонсо");
                put("попов", "владимир");
                put("усов", "игорь");
                put("родригес", "оберт");
                put("деревянский", "семен");
                put("суслович", "рафаил");
                put("тёртелтауб", "джон");
                put("брест", "мартин");
                put("оз", "фрэнк");
                put("стрейч", "янис");
                put("хейфиц", "иосиф");
                put("ардолино", "эмиль");
                put("кэмпбелл", "мартин");
                put("мейерс", "нэнси");
                put("лелуш", "клод");
                put("вачовски", "лана");
                put("вачовски", "лилли");
                put("рауш", "ирма");
                put("гидройк", "коки");
                put("курихин", "никита");
                put("вульфович", "теодор");
                put("кремнев", "валерий");
                put("дербенёв", "вадим");
                put("бунюэль", "луис");
                put("левинсон", "барри");
                put("балаян", "роман");
                put("уэллс", "орсон");
                put("скотт", "тони");
                put("паркер", "алан");
                put("гиллермин", "джон");
                put("егиазаров", "гавриил");
                put("храбровицкий", "даниил");
                put("торнаторе", "джузеппе");
                put("ивченко", "виктор");
                put("герман", "алексей");
                put("кулиш", "савва");
                put("линч", "дэвид");
                put("райтман", "айван");
                put("бренч", "алоиз");
                put("добролюбов", "игорь");
                put("аркуш", "аллан");
                put("уайзмен", "сэм");
                put("перри финнерман", "джералд");
                put("петров", "владимир");
                put("цуцульковский", "лев");
                put("о'коннор", "пэт");
                put("фрирз", "стивен");
                put("киселев", "дмитрий");
                put("лукашевич", "татьяна");
                put("ромм", "михаил");
                put("васильев", "дмитрий");
                put("мишель", "андре");
                put("аронофски", "даррен");
                put("герасимов", "владимир");
                put("литус", "николай");
                put("шунько", "виталий");
                put("эйсымонт", "виктор");
                put("бартлетт", "холл");
                put("сергеев", "виктор");
                put("мкртчян", "альберт");
                put("кэмпион", "джейн");
                put("де пальма", "брайан");
                put("анненский", "исидор");
                put("райт", "джо");
                put("карасик", "юлий");
                put("деми", "жак");
                put("стэнтон", "эндрю");
                put("ройзман", "зиновий");
                put("гриффитс", "марк");
                put("хайерс", "сидни");
                put("столбов", "александр");
                put("любимов", "павел");
                put("звягинцев", "андрей");
                put("шипенко", "клим");
                put("жёне", "жан-пьер");
                put("филатов", "леонид");
                put("матисон", "анна");
                put("юран", "натан");
                put("басов", "владимир");
                put("басова", "ольга");
                put("бабич", "искра");
                put("софтли", "иэн");
                put("хуциев", "марлен");
                put("байсак", "геннадий");
                put("хенкель фон доннерсмарк", "флориан");
                put("кара", "юрий");
                put("бэ", "майкл");
                put("эммерих", "роланд");
                put("маршалл", "роб");
                put("жебрюнас", "арунас");
                put("манн", "майкл");
                put("рафелсон", "боб");
                put("никифоров", "вячеслав");
                put("гурин", "илья");
                put("птушко", "александр");
                put("вятич-бережных", "дамир");
                put("пудовкин", "всеволод");
                put("доллер", "михаил");
                put("хиллер", "артур");
                put("плучек", "валентин");
                put("аронов", "григорий");
                put("иванович лебедев", "николай");
                put("ясан", "эрнес");
                put("галин", "александр");
                put("бланк", "александр");
                put("линков", "сергей");
                put("фролов", "андрей");
                put("жанс", "ксавье");
                put("разенков", "андрей");
                put("ховард", "рон");
                put("ивановский", "александр");
                put("росселлини", "роберто");
                put("чухрай", "павел");
                put("смит", "кевин");
                put("ашкенази", "сергей");
                put("ву", "джон");
                put("сахаров", "алексей");
                put("кассаветис", "ник");
                put("липшиц", "григорий");
                put("резников", "анатолий");
                put("бойл", "дэнни");
                put("гиллиам", "терри");
                put("праздников", "алексей");
                put("басин", "сергей");
                put("капица", "кирилл");
                put("месхиев", "дмитрий");
                put("тодоровский", "валерий");
                put("борживой", "земан");
                put("дамиани", "дамиано");
                put("ванчини", "флорестано");
                put("перелли", "луиджи");
                put("накаш", "оливье");
                put("толедано", "эрик");
                put("котт", "александр");
                put("верховен", "пол");
                put("ахадов", "валерий");
                put("бобровский", "анатолий");
                put("рейнолдс", "кевин");
                put("фоменко", "пётр");
                put("ратнер", "бретт");
                put("аменабар", "алехандро");
                put("ван сент", "гас");
                put("фрэнкел", "дэвид");
                put("мамин", "юрий");
                put("аллерс", "роджер");
                put("минкофф", "роб");
                put("магуаер", "шэрон");
                put("меликян", "анна");
                put("роббинс", "тим");
                put("эфрон", "нора");
                put("ордынский", "василий");
                put("агранович", "михаил");
                put("янковский", "олег");
                put("маршалл", "гэрри");
                put("снежко-блоцкая", "александра");
                put("ливанов", "василий");
                put("зябликова", "аида");
                put("лебедев", "николай");
                put("мате", "рудольф");
                put("стрелков", "владимир");
                put("какояннис", "михалис");
                put("субхаш", "баббар");
                put("мэдден", "джон");
                put("херсковиц", "маршалл");
                put("борецкий", "юрий");
                put("полковников", "владимир");
                put("снежко-блоцкая", "александра");
                put("рыбарёв", "валерий");
                put("апасян", "игорь");
                put("франчиши", "пьетро");
                put("кёрран", "джон");
                put("пархоменко", "павел");
                put("малкэхи", "рассел");
                put("коппола", "софи");
                put("фарелли", "братья");
                put("беренштейн", "владимир");
                put("гурин", "илья");
                put("луков", "леонид");
                put("клеман", "рене");
                put("барбера", "джозеф");
                put("ханна", "уильям");
                put("исинг", "рудольф");
                put("ильинский", "игорь");
                put("сааков", "юрий");
                put("ливен", "джерими");
                put("иванов", "виталий");
                put("жаров", "михаил");
                put("миллер", "джордж");
                put("нугманов", "рашид");
                put("феста кампаниле", "паскуале");
                put("джордан", "нил");
                put("вадим", "роже");
                put("шенгелия", "георгий");
                put("лэндис	", "джон");
                put("муратова", "кира");
                put("долдри", "стивен");
                put("бергер", "нейл");
                put("бланк", "александр");
                put("андерсон", "линдсей");
                put("хотиненко", "владимир");
                put("демме", "тед");
                put("робинсон", "брюс");
                put("олег", "тепцов");
                put("зонненфельд", "барри");
                put("фосс", "боб");
                put("фрэз", "илья");
                put("чеботарев", "владимир");
                put("боголюбов", "александр");
                put("альмодовар", "педро");
                put("эфрос", "анатолий");
                put("кьюкор", "джордж");
                put("лайман", "даг");
                put("бунеев", "борис");
                put("праздников", "алексей");
                put("кауфман", "филипп");
                put("анно", "жан-жак");
                put("зейтун", "ариэль");
                put("бресс", "эрик");
                put("ян", "томас");
                put("озон", "франсуа");
                put("чечик", "джеремайя");
                put("уэллер", "питер");
                put("линн", "джонатан");
                put("мактирнан", "джон");
                put("иванов-вано", "иван");
                put("бутаков", "борис");
                put("чернов", "денис");
                put("пичул", "василий");
                put("кеосаян", "тигран");
                put("аугуст", "билле");
                put("трахтенберг", "наум");
                put("джерми", "пьетро");
                put("мэннерс", "ким");
                put("боумен", "роб");
                put("наттер", "дэвид");
                put("лотяну", "эмиль");
                put("франкенхаймер", "джон");
                put("кепп", "дэвид");
                put("депп", "джонни");
                put("астрахан", "дмитрий");
                put("костнер", "кевин");
                put("форстер", "марк");
                put("данелия", "георгий");
                put("таланкин", "игорь");
                put("йейтс", "дэвид");
                put("миядзаки", "хаяо");
                put("найт шьямалан", "м.");
                put("колосов", "сергей");
                put("клушанцев", "павел");
                put("иствуд", "клинт");
                put("маллиган", "роберт");
                put("брукс", "джеймс");
                put("персивал", "брайан");
                put("гейл", "боб");
                put("жалакявичюс", "витаутас");
                put("данмор", "лоуренс");
                put("таланкин", "игорь");
                put("рассел", "чак");
                put("пенн", "артур");
                put("херрингтон", "роуди");
                put("брана", "кеннет");
                put("степанов", "борис");
                put("брукс", "ричард");
                put("кэздан", "лоуренс");
                put("василевский", "радомир");
                put("туманов", "семён");
                put("хьюз", "альберт");
                put("хьюз", "аллен");
                put("берри", "клод");
                put("стеллинг", "йос");
                put("виник", "гари");
                put("гринуэй", "питер");
                put("хазанавичус", "мишель");
                put("довгань", "владимир");
                put("николс", "майк");
                put("фонтен", "анн");
                put("наир", "мира");
                put("леконт", "патрис");
                put("капур", "шекхар");
                put("пружанский", "ефрем");
                put("жоффе", "роланд");
                put("кидрон", "бибан");
                put("маршалл", "пенни");
                put("аркан", "дени");
                put("орлов", "марк");
                put("сегал", "мохан");
                put("оганесян", "карен");
                put("худяков", "константин");
                put("гонзалез молина", "фернандо");
                put("мегердичев", "антон");
                put("клайзер", "рэндал");
                put("ардашников", "наум");
                put("ефремов", "олег");
                put("новак", "виллен");
                put("гресь", "виктор");
                put("егоров", "юрий");
                put("поттер", "салли");
                put("вачовски", "дуэт");
                put("тыквер", "том");
                put("адамсон", "эндрю");
                put("дженсон", "вики");
                put("рэвич", "рэнд");
                put("андерс", "элисон");
                put("рокуэлл", "александр");
                put("родригес", "роберт");
                put("тарантино", "квентин");
                put("руф", "максим");
                put("игоревич лебедев", "николай");
                put("джонстон", "джо");
                put("бычков", "владимир");
                put("протазанов", "яков");
                put("паркер", "оливер");
                put("агрести", "алехандро");
                put("дамиани", "дамиано");
                put("казан", "элиа");
                put("экк", "николай");
                put("абалов", "эдуард");
                put("юис", "джейми");
                put("бентон", "роберт");
                put("алеников", "владимир");
                put("гондри", "мишель");
                put("маккуин", "стив");
                put("соммерс", "стивен");
                put("дженнингс", "гарт");
                put("андерсон", "пол");
                put("лурман", "баз");
                put("нойс", "филипп");
                put("чимино", "майкл");
                put("дубровин", "юрий");
                put("содерберг", "стивен");
                put("кёртис", "ричард");
                put("нахапетов", "родион");
                put("грамматиков", "владимир");
                put("евлахишвили", "сергей");
                put("петров", "александр");
                put("салтыков", "алексей");
                put("викторов", "ричард");
                put("мирошниченко", "сергей");
                put("гайдай", "леонид");
                put("орко", "ристо");
                put("андерсон", "уэс");
                put("лейманис", "александр");
                put("шерфиг", "лоне");
                put("ли", "энг");
                put("сальче", "лучано");
                put("паренти", "нери");
                put("сокуров", "александр");
                put("воркман", "чак");
                put("муччино", "габриэль");
                put("хармон", "роберт");
                put("сабо", "иштван");
                put("доннелли", "киаран");
                put("подесва", "джереми");
                put("уолш", "дирбла");
                put("мэннерс", "ким");
                put("коркоран", "билл");
                put("уитмор мл", "джеймс");
                put("качанов", "роман");
                put("эптид", "майкл");
                put("култер", "аллен");
                put("по", "алан");
                put("каурисмяки", "мика");
                put("фултон", "кит");
                put("пепе", "луис");
                put("таланкин", "игорь");
                put("таланкин", "дмитрий");
                put("уорд", "винсент");
                put("иванов-вано", "иван");
                put("снежко-блоцкая", "александра");
                put("николс", "майк");
                put("вайда", "анджей");
                put("линч", "дэвид");
                put("фрост", "марк");
                put("уайз", "роберт");
                put("дьюк", "дэрил");
                put("литус", "николай");
                put("симоненко", "иван");
                put("шнабель", "юлиан");
                put("дель торо", "гильермо");
                put("иванов-вано", "иван");
                put("мильчин", "лев");
                put("доннер", "ричард");
                put("харлин", "ренни");
                put("варнье", "режис");
                put("бурмен", "джон");
                put("никкол", "эндрю");
                put("бардин", "гарри");
                put("сторожева", "вера");
                put("ольшвангер", "илья");
                put("лайн", "эдриан");
                put("кулиджанов", "лев");
                put("сегель", "яков");
                put("мактиг", "джеймс");
                put("о'брайэн", "джим");
                put("кёртис", "майкл");
                put("цехановский", "михаил");
                put("эрман", "джон");
                put("хупер", "том");
                put("довлатян", "фрунзе");
                put("мирский", "лев");
                put("блэр", "дэвид");
                put("попов", "владимир");
                put("хэнсон", "кёртис");
                put("райнер", "роб");
                put("хэнд", "дэвид");
                put("грено", "натан");
                put("ховард", "байрон");
                put("уотерс", "джон");
                put("хаггис", "пол");
                put("шахмалиева", "аян");
                put("приёмыхов", "валерий");
                put("лассетер", "джон");
                put("кершброн", "жан");
                put("лукас", "джордж");
                put("каурисмяки", "аки");
                put("голуб", "лев");
                put("георгиев", "виктор");
                put("стиллер", "бен");
                put("сингер", "брайан");
                put("паркер", "трей");
                put("стоун", "мэтт");
                put("адамсон", "эндрю");
                put("лайн", "эдриан");
                put("ханеке", "михаэль");
                put("ван дормель", "жако");
                put("петрухин", "федор");
                put("ишмухамедов", "эльёр");
                put("кроманов", "григорий");
                put("чхан ук", "пак");
                put("дахно", "владимир");
                put("итыгилов", "александр");
                put("томас андерсон", "пол");
                put("малик", "терренс");
                put("селезнева", "инесса");
                put("сукачёв", "гарик");
                put("миллер", "фрэнк");
                put("родригес", "роберт");
                put("тарантино", "квентин");
                put("злoбин", "вадим");
                put("opлoв", "mapк");
                put("пчeлкин", "лeoнид");
                put("аббасов", "шухрат");
                put("барщевский", "антон");
                put("мур", "майкл");
                put("эгоян", "атом");
                put("рэй", "николас");
                put("говорухин", "станислав");
                put("дуров", "борис");
                put("макнотон", "джон");
                put("шор", "дэвид");
                put("летерье", "луи");
                put("о'хенлон", "джим");
                put("маршалл", "фрэнк");
                put("бабаян", "агаси");
                put("дёжкин", "борис");
                put("олтман", "роберт");
                put("калатозишвили", "георгий");
                put("васильев", "геннадий");
                put("калик", "михаил");
                put("цвик", "эдвард");
                put("ледер", "мими");
                put("нишимура", "киёси");
                put("соловьев", "сергей");
                put("бычкова", "оксана");
                put("хаф", "джон");
                put("рифеншталь", "лени");
                put("трусдейл", "гэри");
                put("блие", "бертран");
                put("тарасов", "сергей");
                put("майкл макдонах", "джон");
                put("лоуренс", "фрэнсис");
                put("шамшиев", "болотбек");
                put("бунеев", "борис");
                put("данилин", "сергей");
                put("татарский", "евгений");
                put("лагравенес", "ричард");
                put("федорова", "мария");
                put("линклейтер", "ричард");
                put("сандерс", "крис");
                put("деблуа", "дин");
                put("трюффо", "франсуа");
                put("хажкасимов", "хасан");
                put("иванович лебедев", "николай");
                put("букреев", "борис");
                put("ульянов", "михаил");
                put("иванов-вано", "иван");
                put("жаке", "люк");
                put("аравин", "александр");
                put("македонский", "владимир");
                put("зэфф", "дэн");
                put("манден", "марк");
                put("адамек", "витольд");
                put("шахбазян", "сурен");
                put("миронер", "феликс");
                put("фукуа", "антуан");
                put("сидоров", "алексей");
                put("стаменкович", "мики");
                put("кунен", "ян");
                put("левчук", "тимофей");
                put("ершов", "константин");
                put("сафран", "генри");
                put("машков", "владимир");
                put("гинзбург", "сергей");
                put("карсон", "дэвид");
                put("уайз", "херберт");
                put("симонов", "алексей");
                put("швайгер", "тиль");
                put("пронин", "василий");
                put("аббас", "ходжа");
                put("хилл", "уолтер");
                put("кустурица", "эмир");
                put("ли", "спайк");
                put("ву", "джон");
                put("скотт", "ридли");
                put("яковлев", "андрей");
                put("гресь", "анна");
                put("зобин", "вадим");
                put("картер", "крис");
        }};

    public static HashMap<String, String> SynonymDictionary = new HashMap<>() {{
        put("советск", "ссср");
        put("отечествен", "россия");
        put("наш", "россия");
        put("американск", "сша");
        put("британск", "великобритания");
        put("английск", "великобритания");
        put("мультик", "мультфильм");
        put("мульт", "мультфильм");
        put("воен", "военный");
        put("комед", "комедия");
        put("нов", "новый");
        put("стар", "старый");
        put("хорош", "хороший");
        put("плох", "плохой");
        put("немецк", "германия");
        put("семейн", "семейный");
        put("французск", "франция");
    }};
}