package Database;

import Database.MovieRepository.Movie;

import java.util.HashMap;

public class Arrays {

    public static Movie[] movieRepositoryArray = new Movie[]{
            new Movie(
                    "Унесённые призраками",
                    "Аниме",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Ходячий замок",
                    "Аниме",
                    "Полнометражка",
                    2004,
                    "Япония",
                    8.3,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Твоё имя",
                    "Аниме",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Зелёная книга",
                    "Биография",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Поймай меня, если сможешь",
                    "Криминал",
                    "Полнометражка",
                    2002,
                    "США",
                    8.5,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Начало",
                    "Фантастика",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Брат 2",
                    "Боевик",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джанго освобожденный",
                    "Вестерн",
                    "Полнометражка",
                    2012,
                    "США",
                    8.2,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Омерзительная восьмерка",
                    "Вестерн",
                    "Полнометражка",
                    2015,
                    "США",
                    7.9,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "В бой идут одни \"старики\"",
                    "Военный",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.7,
                    "Леонид Быков"
            ),
            new Movie(
                    "Пианист",
                    "Военный",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Спасти рядового Райана",
                    "Военный",
                    "Полнометражка",
                    1998,
                    "США",
                    8.2,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Остров проклятых",
                    "Детектив",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Достать ножи",
                    "Детектив",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Шерлок",
                    "Детектив",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Детский",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Детский",
                    "Мультсериал",
                    2003,
                    "Россия",
                    7.3,
                    "Илья Попов"
            ),
            new Movie(
                    "Фиксики",
                    "Детский",
                    "Мультсериал",
                    2010,
                    "Россия",
                    6.9,
                    "Василий Бедошвили"
            ),
            new Movie(
                    "Романовы",
                    "Документальный",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "Документальный",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Следствие вели",
                    "Документальный",
                    "Сериал",
                    2006,
                    "Россия",
                    7.9,
                    "Дмитрий Докучаев"
            ),
            new Movie(
                    "Зелёная книга",
                    "Драма",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Остров проклятых",
                    "Драма",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Игра",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Игра",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Игра",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Романовы",
                    "История",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "История",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Титаник",
                    "История",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джентельмены",
                    "Комедия",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Комедия",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Бриллиантовая рука",
                    "Комедия",
                    "Полнометражка",
                    1968,
                    "СССР",
                    8.5,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Короткометражка",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Самогонщики",
                    "Короткометражка",
                    "Короткометражка",
                    1962,
                    "СССР",
                    8.3,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Наваждение",
                    "Короткометражка",
                    "Короткометражка",
                    1965,
                    "СССР",
                    8.8,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Джентельмены",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Брат 2",
                    "Криминал",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Достать ножи",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Твоё имя",
                    "Мелодрама",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Титаник",
                    "Мелодрама",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Друзья",
                    "Мелодрама",
                    "Сериал",
                    1994,
                    "США",
                    9.2,
                    "Гари Хэлворсон"
            ),
            new Movie(
                    "Пианист",
                    "Музыка",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Музыка",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэмьен Шазелл"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Мультфильм",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Мультфильм",
                    "Сериал",
                    2003,
                    "Россия",
                    7.3,
                    "Денис Чернов"
            ),
            new Movie(
                    "Холодное сердце",
                    "Мультфильм",
                    "Полнометражка",
                    2013,
                    "США",
                    7.8,
                    "Крис Бак"
            ),
            new Movie(
                    "Алладин",
                    "Мюзикл",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Мюзикл",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэиьен Шазелл"
            ),
            new Movie(
                    "Кошмар перед Рождеством",
                    "Мюзикл",
                    "Полнометражка",
                    1993,
                    "США",
                    8.0,
                    "Генри Селик"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Приключения",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Приключения",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Реальное ТВ",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Реальное ТВ",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Реальное ТВ",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Алладин",
                    "Семейный",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Семейный",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Семейный",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Начало",
                    "Триллер",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Шерлок",
                    "Триллер",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Унесённые призраками",
                    "Фэнтези",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Фэнтези",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Фэнтези",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            )
    };

    public static String[] Category = new String[]{ //0-2
            "фильм", "сериал", "короткометражка"
    };

    public static String[] Country = new String[]{ // 3 - 200
            "австралия", "австрия", "азербайджан", "албания", "алжир",
            "ангола", "андорра", "антарктида", "aргентина", "армения",
            "aруба", "афганистан", "багамы", "бангладеш", "барбадос",
            "бахрейн", "беларусь", "белиз", "бельгия", "бенин",
            "бермуды", "бирма", "болгария", "боливия", "босния",
            "ботсвана", "бразилия", "бруней-даруссалам", "буркина-фасо", "бурунди",
            "бутан", "вануату", "ватикан", "великобритания", "венгрия",
            "венесуэла", "вьетнам", "габон", "гаити", "гайана",
            "гамбия", "гана", "гваделупа", "гватемала", "гвинея",
            "германия", "гибралтар", "гренада", "гренландия", "греция",
            "грузия", "гуам", "дания", "джибути", "доминика",
            "доминикана", "египет", "замбия", "зимбабве", "гондурас",
            "гонконг", "заир", "израиль", "индонезия", "индия",
            "иордания", "ирак", "иран", "ирландия", "исландия",
            "испания", "италия", "йемен", "кабо-верде", "казахстан",
            "камбоджа", "камерун", "канада", "катар", "кения",
            "кипр", "киргизия", "кирибати", "китай", "колумбия",
            "коморы", "конго", "корея", "косово", "коста-рика",
            "кот-д'ивуар", "куба", "кувейт", "лаос", "латвия",
            "лесото", "либерия", "ливан", "ливия", "литва",
            "лихтенштейн", "люксембург", "маврикий", "мавритания", "мадагаскар",
            "макао", "македония", "малави", "малайзия", "мали",
            "мальдивы", "мальта", "марокко", "мартиника", "масаи",
            "мексика", "мозамбик", "молдова", "монако", "монголия",
            "монтсеррат", "мьянма", "намибия", "непал", "нигер",
            "нигерия", "нидерланды", "никарагуа", "норвегия", "оаэ",
            "оман", "кука", "пакистан", "палау", "палестина",
            "панама", "парагвай", "перу", "польша", "португалия",
            "реюньон", "россия", "руанда", "румыния", "сальвадор",
            "самоа", "свазиленд", "сенегал", "сербия", "сиам",
            "сингапур", "сирия", "словакия", "словения", "сомали",
            "ссср", "судан", "суринам", "сша", "сьерра-леоне",
            "таджикистан", "таиланд", "тайвань", "танзания", "тимор-лесте",
            "того", "тонга", "тувалу", "тунис", "туркменистан",
            "турция", "уганда", "узбекистан", "украина", "уругвай",
            "фиджи", "филиппины", "финляндия", "франция", "хорватия",
            "цар", "чад", "черногория", "чехия", "чехословакия",
            "чили", "швейцария", "швеция", "шри-ланка", "эквадор",
            "эритрея", "эстония", "эфиопия", "юар", "югославия",
            "югославия", "ямайка", "япония"
    };

    public static String[] Genre = new String[]{ // 201 - 231
            "комедия", "мультфильм", "ужасы",
            "фантастика", "триллер", "боевик",
            "мелодрама", "детектив", "приключения",
            "фэнтези", "военный", "семейный",
            "аниме", "исторический", "драма",
            "документальный", "детский", "криминал",
            "биография", "вестерн", "фильм-нуар",
            "спорт", "тв",
            "концерт", "музыка", "мюзикл",
            "ток-шоу", "новости", "игра", "церемония"
    };

    public static String[] Director = new String[]{
            "эльдар рязанов", "леонид гайдай", "марк захаров", "станислав ростоцкий", "станислав говорухин", "игорь масленников",
            "георгий юнгвальд-хилькевич", "вениамин дорман", "ян фрид", "владимир бортко", "георгий данелия",
            "алла сурикова", "сергей бондарчук", "татьяна лиознова", "роберт земекис", "франсис вебер",
            "леонид быков", "андрей тарковский", "юрий чулюкин", "александр павловский", "михаил швейцер",
            "константин бромберг", "евгений татарский", "владимир меньшов", "жерар ури", "александр серый",
            "михаил козаков", "кастеллано и пиполо", "евгений ташков", "евгений карелов", "владимир мотыль",
            "александр роу", "стэнли кубрик", "александр рогожкин", "леонид квинихидзе", "григорий александров",
            "эдуар молинаро", "надежда кошеверова", "эдмонд кеосаян", "григорий чухрай", "жан жиро",
            "николай калинин", "владимир фетин", "федерико феллини", "алексей балабанов", "лукино висконти",
            "никита михалков", "карен шахназаров", "марлен хуциев", "феликс миронер", "иван пырьев",
            "питер джексон", "ежи гофман", "франко проспери", "эльдар рязанов", "андрэ юнебель",
            "сергей урсуляк", "василий шукшин", "ив робер", "франко кастеллано", "джузеппе моччиа",
            "владимир воробьёв", "александр птушко", "джеймс кэмерон", "тим бёртон", "геральд бежанов",
            "элем климов", "стивен спилберг", "крис коламбус", "валерий усков", "владимир краснопольский",
            "милош форман", "алексей коренев", "фрэнсис форд коппола", "виталий мельников", "андрей тутышкин",
            "семен тимошенко", "наум бирман", "бернардо бертолуччи", "юлиуш махульский", "клод зиди",
            "михаил калатозов", "ларс фон триер", "андрей малюков", "микеланджело антониони", "александр алов",
            "владимир наумов", "александр митта", "дэвид финчер", "сергей герасимов", "владимир роговой",
            "анатолий граник", "виктор макаров", "александр полынников", "светлана дружинина", "серж корбер",
            "владимир басов", "ридли скотт", "роман полански", "александр зархи", "эмир кустурица",
            "александр прошкин", "фёдор хитрук", "рамеш сипи", "мэл гибсон", "александр муратов",
            "борис степанов", "вячеслав никифоров", "геннадий иванов", "олег фомин", "джерри цукер",
            "уильям уайлер", "сидни поллак", "лассе халльстрём", "эльдор уразбаев", "джон бэдэм",
            "жерар пирес", "вацлав ворличек", "алехандро гонсалес иньярриту", "григорий кохан", "григорий козинцев",
            "ингмар бергман", "альфред форер", "дино ризи", "харольд рамис", "андрей смирнов",
            "альберт мкртчян", "леонид попов", "генрих оганесян", "квентин тарантино", "надежда кошеверов",
            "михаил шапиро", "ярополк лапшин", "виктор храмов", "валентин плучек", "самвел гаспаров",
            "андре юнебель", "жерар кравчик", "кристиан жак", "льюис тиг", "владимир вайншток",
            "джон корнелл", "альфред хичкок", "самсон самсонов", "джек бендер", "стивен уильямс",
            "геннадий полока", "павел арсенов", "серджио леоне", "питер файман", "геннадий казанский",
            "владимир чеботарёв", "леонид нечаев", "виктор трегубович", "олег бондарев", "оливер стоун",
            "михаил ромм", "серджио корбуччи", "константин воинов", "андрей кончаловский", "джулиан эмис",
            "люк бессон", "билли уайлдер", "вуди аллен", "акира куросава", "бернар бордери",
            "константин ершов", "георгий кропачев", "александр птушко", "сергей эйзенштейн", "робер энрико",
            "чарли чаплин", "геннадий казанский", "иван лукинский", "павел лунгин", "джордж даннинг",
            "аркадий райкин", "виктор храмов", "пётр тодоровский", "ролан быков", "жорж лотнер",
            "виктор иванов", "юрий норштейн", "константин юдин", "фрэнк дарабонт", "мартин скорсезе",
            "франко дзеффирелли", "вольфганг петерсен", "гарри маршалл", "пьер паоло пазолини", "серджо корбуччи",
            "лев кулиджанов", "виктор флеминг", "джордж кьюкор", "сэм вуд", "дмитрий дьяченко",
            "том шедьяк", "вадим абдрашитов", "глеб панфилов", "роберто бениньи", "блэйк эдвардс",
            "кэтрин бигелоу", "александр файнциммер", "александр иванов", "юлий гусман", "динара асанова",
            "давид черкасский", "саймон лэнгтон", "виллен азаров", "олег кузовков", "олег ужинов",
            "денис червяцов", "юлий райзман", "юрий озеров", "борис равенских", "татьяна лукашевич",
            "николай досталь", "андрей тутышкин", "сергей микаэлян", "михаил царёв", "василий левин",
            "вернер херцог", "гор вербински", "валерий рубинчик", "братья коэн", "михаил юзовский",
            "александр столпер", "борис иванов", "джоэл шумахер", "александр ивановский", "надежда кошеверова",
            "инесса ковалевская", "александр белинский", "алан тейлор", "алекс грейвз", "даниэль минахан",
            "гай ричи", "абрам народицкий", "николай рашеев", "борис рыцарев", "виктор титов",
            "леонид луков", "резо чхеидзе", "джозеф манкевич", "вячеслав котёночкин", "герберт раппапорт",
            "жак дере", "лев атаманов", "фёдор хитрук", "геннадий сокольский", "сергей соловьев",
            "майк ньюэлл", "джей ли томпсон", "роман абелевич качанов", "энтони мингелла", "борис степанцев",
            "филипп де брока", "семён аранович", "борис дуров", "григорий рошаль", "александр татарский",
            "джонатан демми", "александр столпер", "михаил жаров", "рихард грошопп", "луи де фюнес",
            "майкл леманн", "стэнли крамер", "тэйлор хэкфорд", "питер уир", "сергей сиделев",
            "вячеслав бровкин", "юрий кротенко", "геннадий павлов", "василий давидчук", "джим джармуш",
            "эдуард назаров", "владимир назаров", "джаник файзиев", "григорий козинцев", "леонид трауберг",
            "такеши китано", "кристофер нолан", "ричард левинсон", "уильям линк", "роман давыдов",
            "лариса шепитько", "витторио де сика", "владимир попков", "вим вендерс", "саймон уинсер",
            "александр бурцев", "илья макаров", "михаил вассербаум", "юрий музыка", "владимир фокин",
            "николай литус", "алексей мишурин", "евгений матвеев", "альфонсо куарон", "владимир попов",
            "игорь усов", "оберт родригес", "семен деревянский", "рафаил суслович", "джон тёртелтауб",
            "мартин брест", "фрэнк оз", "янис стрейч", "иосиф хейфиц", "эмиль ардолино",
            "мартин кэмпбелл", "нэнси мейерс", "клод лелуш", "лана вачовски", "лилли вачовски",
            "ирма рауш", "коки гидройк", "никита курихин", "теодор вульфович", "валерий кремнев",
            "вадим дербенёв", "луис бунюэль", "барри левинсон", "роман балаян", "орсон уэллс",
            "тони скотт", "алан паркер", "джон гиллермин", "гавриил егиазаров", "даниил храбровицкий",
            "джузеппе торнаторе", "виктор ивченко", "алексей герман", "савва кулиш", "дэвид линч",
            "айван райтман", "алоиз бренч", "игорь добролюбов", "аллан аркуш", "сэм уайзмен",
            "джералд перри финнерман", "владимир петров", "лев цуцульковский", "пэт о'коннор", "стивен фрирз",
            "дмитрий киселев", "татьяна лукашевич", "михаил ромм", "дмитрий васильев", "андре мишель",
            "даррен аронофски", "владимир герасимов", "николай литус", "виталий шунько", "виктор эйсымонт",
            "холл бартлетт", "виктор сергеев", "альберт мкртчян", "джейн кэмпион", "брайан де пальма",
            "исидор анненский", "джо райт", "юлий карасик", "жак деми", "эндрю стэнтон",
            "зиновий ройзман", "марк гриффитс", "сидни хайерс", "александр столбов", "павел любимов",
            "андрей звягинцев", "клим шипенко", "жан-пьер жёне", "леонид филатов", "анна матисон",
            "натан юран", "владимир басов", "ольга басова", "искра бабич", "иэн софтли",
            "марлен хуциев", "геннадий байсак", "флориан хенкель фон доннерсмарк", "юрий кара", "майкл бэ",
            "роланд эммерих", "роб маршалл", "арунас жебрюнас", "майкл манн", "боб рафелсон",
            "вячеслав никифоров", "илья гурин", "александр птушко", "дамир вятич-бережных", "всеволод пудовкин",
            "михаил доллер", "артур хиллер", "валентин плучек", "григорий аронов", "николай иванович лебедев",
            "эрнес ясан", "александр галин", "александр бланк", "сергей линков", "андрей фролов",
            "ксавье жанс", "андрей разенков", "рон ховард", "александр ивановский", "роберто росселлини",
            "павел чухрай", "кевин смит", "сергей ашкенази", "джон ву", "алексей сахаров",
            "ник кассаветис", "григорий липшиц", "анатолий резников", "дэнни бойл", "терри гиллиам",
            "алексей праздников", "сергей басин", "кирилл капица", "дмитрий месхиев", "валерий тодоровский",
            "земан борживой", "дамиано дамиани", "флорестано ванчини", "луиджи перелли", "оливье накаш",
            "эрик толедано", "александр котт", "пол верховен", "валерий ахадов", "анатолий бобровский",
            "кевин рейнолдс", "пётр фоменко", "бретт ратнер", "алехандро аменабар", "гас ван сент",
            "дэвид фрэнкел", "юрий мамин", "роджер аллерс", "роб минкофф", "шэрон магуаер",
            "анна меликян", "тим роббинс", "нора эфрон", "василий ордынский", "михаил агранович",
            "олег янковский", "гэрри маршалл", "александра снежко-блоцкая", "василий ливанов", "аида зябликова",
            "николай лебедев", "рудольф мате", "владимир стрелков", "михалис какояннис", "баббар субхаш",
            "джон мэдден", "маршалл херсковиц", "юрий борецкий", "владимир полковников", "александра снежко-блоцкая",
            "валерий рыбарёв", "игорь апасян", "пьетро франчиши", "джон кёрран", "павел пархоменко",
            "рассел малкэхи", "софи коппола", "братья фарелли", "владимир беренштейн", "илья гурин",
            "леонид луков", "рене клеман", "джозеф барбера", "уильям ханна", "рудольф исинг",
            "игорь ильинский", "юрий сааков", "джерими ливен", "виталий иванов", "михаил жаров",
            "джордж миллер", "рашид нугманов", "паскуале феста кампаниле", "нил джордан", "роже вадим",
            "георгий шенгелия", "джон лэндис	", "кира муратова", "стивен долдри", "нейл бергер",
            "александр бланк", "линдсей андерсон", "владимир хотиненко", "тед демме", "брюс робинсон",
            "тепцов олег", "барри зонненфельд", "боб фосс", "илья фрэз", "владимир чеботарев",
            "александр боголюбов", "педро альмодовар", "анатолий эфрос", "джордж кьюкор", "даг лайман",
            "борис бунеев", "алексей праздников", "филипп кауфман", "жан-жак анно", "ариэль зейтун",
            "эрик бресс", "томас ян", "франсуа озон", "джеремайя чечик", "питер уэллер",
            "джонатан линн", "джон мактирнан", "иван иванов-вано", "борис бутаков",
            "денис чернов", "василий пичул", "тигран кеосаян", "билле аугуст", "наум трахтенберг",
            "пьетро джерми", "ким мэннерс", "роб боумен", "дэвид наттер", "эмиль лотяну",
            "джон франкенхаймер", "дэвид кепп", "джонни депп", "дмитрий астрахан", "кевин костнер",
            "марк форстер", "георгий данелия", "игорь таланкин", "дэвид йейтс", "хаяо миядзаки",
            "м. найт шьямалан", "сергей колосов", "павел клушанцев", "клинт иствуд", "роберт маллиган",
            "джеймс брукс", "брайан персивал", "боб гейл", "витаутас жалакявичюс", "лоуренс данмор",
            "игорь таланкин", "чак рассел", "артур пенн", "роуди херрингтон", "кеннет брана",
            "борис степанов", "ричард брукс", "лоуренс кэздан", "радомир василевский", "семён туманов",
            "альберт хьюз", "аллен хьюз", "клод берри", "йос стеллинг", "гари виник",
            "питер гринуэй", "мишель хазанавичус", "владимир довгань", "майк николс", "анн фонтен",
            "мира наир", "патрис леконт", "шекхар капур", "ефрем пружанский", "роланд жоффе",
            "бибан кидрон", "пенни маршалл", "дени аркан", "марк орлов", "мохан сегал",
            "карен оганесян", "константин худяков", "фернандо гонзалез молина", "антон мегердичев", "рэндал клайзер",
            "наум ардашников", "олег ефремов", "виллен новак", "виктор гресь", "юрий егоров",
            "салли поттер", "дуэт вачовски", "том тыквер", "эндрю адамсон", "вики дженсон",
            "рэнд рэвич", "элисон андерс", "александр рокуэлл", "роберт родригес", "квентин тарантино",
            "максим руф", "николай игоревич лебедев", "джо джонстон", "владимир бычков", "яков протазанов",
            "оливер паркер", "алехандро агрести", "дамиано дамиани", "элиа казан", "николай экк",
            "эдуард абалов", "джейми юис", "роберт бентон", "владимир алеников",
            "мишель гондри", "стив маккуин", "стивен соммерс", "гарт дженнингс", "пол андерсон",
            "баз лурман", "филипп нойс", "майкл чимино", "юрий дубровин", "стивен содерберг",
            "ричард кёртис", "родион нахапетов", "владимир грамматиков", "сергей евлахишвили", "александр петров",
            "алексей салтыков", "ричард викторов", "сергей мирошниченко", "леонид гайдай", "ристо орко",
            "уэс андерсон", "александр лейманис", "лоне шерфиг", "энг ли", "лучано сальче",
            "нери паренти", "александр сокуров", "чак воркман", "габриэль муччино", "роберт хармон",
            "иштван сабо", "киаран доннелли", "джереми подесва", "дирбла уолш", "ким мэннерс",
            "билл коркоран", "джеймс уитмор мл", "роман качанов", "майкл эптид", "аллен култер",
            "алан по", "мика каурисмяки", "кит фултон", "луис пепе", "игорь таланкин",
            "дмитрий таланкин", "винсент уорд", "иван иванов-вано", "александра снежко-блоцкая", "майк николс",
            "анджей вайда", "дэвид линч", "марк фрост", "роберт уайз", "дэрил дьюк",
            "николай литус", "иван симоненко", "юлиан шнабель", "гильермо дель торо", "иван иванов-вано",
            "лев мильчин", "ричард доннер", "ренни харлин", "режис варнье", "джон бурмен",
            "эндрю никкол", "гарри бардин", "вера сторожева", "илья ольшвангер", "эдриан лайн",
            "лев кулиджанов", "яков сегель", "джеймс мактиг", "джим о'брайэн", "майкл кёртис",
            "михаил цехановский", "джон эрман", "том хупер", "фрунзе довлатян", "лев мирский",
            "дэвид блэр", "владимир попов", "кёртис хэнсон", "роб райнер", "дэвид хэнд",
            "натан грено", "байрон ховард", "джон уотерс", "пол хаггис", "аян шахмалиева",
            "валерий приёмыхов", "джон лассетер", "жан кершброн", "джордж лукас", "аки каурисмяки",
            "лев голуб", "виктор георгиев", "бен стиллер", "брайан сингер", "трей паркер",
            "мэтт стоун", "эндрю адамсон", "эдриан лайн", "михаэль ханеке", "жако ван дормель",
            "федор петрухин", "эльёр ишмухамедов", "григорий кроманов", "пак чхан ук", "владимир дахно",
            "александр итыгилов", "пол томас андерсон", "терренс малик", "инесса селезнева", "гарик сукачёв",
            "фрэнк миллер", "роберт родригес", "квентин тарантино", "вадим злoбин", "mapк opлoв",
            "лeoнид пчeлкин", "шухрат аббасов", "антон барщевский", "майкл мур", "атом эгоян",
            "николас рэй", "станислав говорухин", "борис дуров", "джон макнотон", "дэвид шор",
            "луи летерье", "джим о'хенлон", "фрэнк маршалл", "агаси бабаян", "борис дёжкин",
            "роберт олтман", "георгий калатозишвили", "геннадий васильев", "михаил калик", "эдвард цвик",
            "мими ледер", "киёси нишимура", "сергей соловьев", "оксана бычкова", "джон хаф",
            "лени рифеншталь", "гэри трусдейл", "бертран блие", "сергей тарасов", "джон майкл макдонах",
            "фрэнсис лоуренс", "болотбек шамшиев", "борис бунеев", "сергей данилин", "евгений татарский",
            "ричард лагравенес", "мария федорова", "ричард линклейтер", "крис сандерс", "дин деблуа",
            "франсуа трюффо", "хасан хажкасимов", "николай иванович лебедев", "борис букреев", "михаил ульянов",
            "иван иванов-вано", "люк жаке", "александр аравин", "владимир македонский", "дэн зэфф",
            "марк манден", "витольд адамек", "сурен шахбазян", "феликс миронер", "антуан фукуа",
            "алексей сидоров", "мики стаменкович", "ян кунен", "тимофей левчук", "константин ершов",
            "генри сафран", "владимир машков", "сергей гинзбург", "дэвид карсон", "херберт уайз",
            "алексей симонов", "тиль швайгер", "василий пронин", "ходжа аббас", "уолтер хилл",
            "эмир кустурица", "спайк ли", "джон ву", "ридли скотт", "андрей яковлев",
            "анна гресь", "вадим зобин", "крис картер"
    };

    public static String[] Lastname = { //232 - 943
            "мотыль", "мактиг", "анненский", "иванов-вано", "маллиган", "протазанов",
            "сегель", "гриффитс", "леоне", "ильинский", "пружанский",
            "джармуш", "говорухин", "альмодовар", "рошаль", "карсон",
            "дружинина", "роговой", "проспери", "дьюк", "быков",
            "петров", "кубрик", "басова", "яковлев", "аллен",
            "накаш", "исинг", "мэдден", "игоревич", "гурин",
            "хэнд", "бабич", "дере", "ян", "брукс",
            "швайгер", "серый", "ромм", "фрэнкел", "абдрашитов",
            "усков", "рейнолдс", "гинзбург", "юран", "павлов",
            "бондарчук", "равенских", "поллак", "петерсен", "хажкасимов",
            "линклейтер", "белинский", "итыгилов", "шапиро", "кепп",
            "opлoв", "форер", "козинцев", "адамсон", "бондарев",
            "шедьяк", "роу", "юзовский", "звягинцев", "аугуст",
            "месхиев", "кошеверов", "селезнева", "эфрон", "арсенов",
            "коламбус", "македонский", "балаян", "нугманов", "захаров",
            "о'коннор", "сегал", "бунеев", "руф", "мирский",
            "нолан", "стоун", "нечаев", "стэнтон",
            "масленников", "маршалл", "сингер", "кар", "меликян",
            "найт", "мирошниченко", "нахапетов", "карасик", "котт",
            "воробьёв", "бертолуччи", "шипенко", "калатозишвили", "грошопп",
            "файзиев", "лассетер", "фомин", "жанс", "вендерс",
            "деми", "демме", "куарон", "фокин", "софтли",
            "сахаров", "кошеверова", "фукуа", "эммерих", "антониони",
            "лэндис	", "висконти", "макаров", "михалков", "линн",
            "наир", "бабаян", "моччиа", "трауберг", "александров",
            "иванов", "гондри", "шнабель", "олег", "котёночкин",
            "бордери", "наумов", "манден", "херрингтон", "лапшин",
            "юнгвальд-хилькевич", "дербенёв", "муччино", "стиллер", "торнаторе",
            "иванович", "робер", "вуд", "данелия", "минахан",
            "ардолино", "смирнов", "хаггис", "трусдейл", "карелов",
            "эмис", "бергер", "рифеншталь", "абалов", "фонтен",
            "гайдай", "праздников", "хотиненко", "барщевский", "линков",
            "махульский", "мэннерс", "цехановский", "герман", "левин",
            "хэнсон", "попков", "сиделев", "доллер", "аронофски",
            "литус", "аркуш", "кеосаян", "даннинг", "уэллер",
            "рокуэлл", "де", "дженсон", "миядзаки", "ужинов",
            "кэздан", "приёмыхов", "варнье", "левинсон", "ховард",
            "уолш", "урсуляк", "грено", "грамматиков", "тёртелтауб",
            "ольшвангер", "лурман", "кёртис", "царёв", "оганесян",
            "климов", "гофман", "викторов", "агрести", "орлов",
            "франкенхаймер", "рэй", "райкин", "николс",
            "бресс", "клушанцев", "гибсон", "леманн", "озон",
            "коренев", "ву", "худяков", "цвик", "ясан",
            "никифоров", "казанский", "кауфман", "ризи", "наттер",
            "герасимов", "довгань", "по", "давыдов", "машков",
            "тарасов", "зиди", "плучек", "самсонов", "ефремов",
            "сабо", "фоменко", "муратова", "георгиев", "аменабар",
            "джерми", "боголюбов", "калинин", "херцог", "о'брайэн",
            "казан", "мельников", "уильямс", "вятич-бережных", "майкл",
            "кулиджанов", "зобин", "клеман", "тутышкин", "херсковиц",
            "шепитько", "уайз", "барбера", "соловьев", "мишель",
            "аранович", "жиро", "шахназаров", "музыка", "магуаер",
            "миллер", "хэкфорд", "швейцер", "роббинс", "салтыков",
            "кэмерон", "фрид", "райнер", "доннелли", "лукас",
            "чернов", "анно", "воинов", "жаров", "рубинчик",
            "агранович", "лукашевич", "злoбин", "гаспаров", "козаков",
            "соммерс", "сипи", "аравин", "тодоровский", "маккуин",
            "лагравенес", "пепе", "верховен", "бобровский", "земекис",
            "чеботарев", "балабанов", "кьюкор", "капур", "филатов",
            "лунгин", "резников", "жалакявичюс", "жоффе", "бардин",
            "жак", "райт", "тыквер", "смит", "новак",
            "рэвич", "скорсезе", "тиг", "брана", "куросава",
            "фрэз", "таланкин", "фон", "снежко-блоцкая", "линч",
            "разенков", "халльстрём", "оз", "данмор", "василевский",
            "скотт", "туманов", "симоненко", "лоуренс", "хенкель",
            "петрухин", "зэфф", "цукер", "аббас", "хьюз",
            "данилин", "хазанавичус", "гидройк", "картер", "субхаш",
            "аркан", "бурцев", "мегердичев", "мишурин", "лейманис",
            "бычкова", "ричи", "титов", "гонсалес", "апасян",
            "пирес", "асанова", "китано", "рауш", "лайн",
            "джордан", "бениньи", "бурмен", "полынников", "бирман",
            "уразбаев", "мамин", "рыцарев", "норштейн", "алов",
            "лэнгтон", "степанов", "вачовски", "аббасов", "манкевич",
            "сурикова", "форд", "бежанов", "дзеффирелли", "мкртчян",
            "хейфиц", "трахтенберг", "чхан", "депп", "кастеллано",
            "экк", "кэмпион", "бэдэм", "квинихидзе", "бунюэль",
            "рашеев", "колосов", "егоров", "вассербаум", "кузовков",
            "финчер", "бровкин", "паренти", "шамшиев", "матвеев",
            "червяцов", "фролов", "доннер", "рогожкин", "шумахер",
            "эгоян", "кравчик", "андерс", "муратов",
            "уитмор", "сааков", "ливен", "галин", "ивченко",
            "кершброн", "гринуэй", "тейлор", "эфрос", "рассел",
            "гресь", "хитрук", "фарелли", "мильчин", "хилл",
            "капица", "федорова", "гонзалез", "дамиани", "ульянов",
            "эрман", "пырьев", "манн", "евлахишвили", "линк",
            "райзман", "ледер", "черкасский", "йейтс", "сальче",
            "вульфович", "рафелсон", "хиллер", "шенгелия", "летерье",
            "ван", "столпер", "ардашников", "полока", "ратнер",
            "дубровин", "хуциев", "борживой", "джонстон", "сафран",
            "лукинский", "коппола", "блэр", "жебрюнас", "ройзман",
            "назаров", "эйзенштейн", "кремнев", "хайерс", "каурисмяки",
            "мингелла", "крамер", "родригес", "народицкий", "томас",
            "франчиши", "пронин", "макки", "макнотон", "нойс",
            "прошкин", "панфилов", "вайда", "трюффо", "байсак",
            "кроманов", "толедано", "виник", "феллини", "перелли",
            "бергман", "малик", "янковский", "басин", "паоло",
            "кассаветис", "деревянский", "уинсер", "ивановский", "ахадов",
            "абелевич", "кулиш", "тарковский", "ташков", "деблуа",
            "миронер", "юдин", "луков", "голуб", "краснопольский",
            "сандерс", "меньшов", "андерсон", "лебедев",
            "шахмалиева", "долдри", "сокольский", "пенн", "лиознова",
            "кэмпбелл", "энрико", "бентон", "татарский", "бартлетт",
            "дель", "файнциммер", "озеров", "хаф", "чеботарёв",
            "букреев", "култер", "уорд", "леконт", "содерберг",
            "ури", "зябликова", "джексон", "кидрон",
            "коркоран", "птушко", "сергеев", "столбов", "какояннис",
            "сукачёв", "корбер", "фрост", "курихин", "костнер",
            "стеллинг", "уотерс", "ростоцкий", "бессон", "сторожева",
            "довлатян", "киселев", "уэллс", "флеминг", "гиллиам",
            "пичул", "ордынский", "о'хенлон", "пудовкин", "чхеидзе",
            "бренч", "липшиц", "рамис", "васильев", "рязанов",
            "бутаков", "рыбарёв", "лотяну", "кара", "эйсымонт",
            "ванчини", "бортко", "боумен", "молинаро", "шор",
            "ишмухамедов", "дуров", "бланк", "дёжкин", "стаменкович",
            "малюков", "азаров", "микаэлян", "алеников", "корбуччи",
            "бигелоу", "гусман", "никкол", "пархоменко", "пчeлкин",
            "юис", "персивал", "храбровицкий", "раппапорт", "митта",
            "зархи", "эптид", "форман", "корнелл", "трегубович",
            "бычков", "дженнингс", "перри", "сидоров", "жаке",
            "полански", "гейл", "орко", "ковалевская", "поттер",
            "вайншток", "фосс", "дорман", "чухрай", "ашкенази",
            "вадим", "чаплин", "стрейч", "иствуд", "фрирз",
            "кунен", "росселлини", "адамек", "степанцев", "демми",
            "жёне", "нишимура", "калатозов", "усов", "бёртон",
            "хичкок", "эдвардс", "грейвз", "брест", "сокуров",
            "тарантино", "матисон", "ершов", "хупер", "райтман",
            "мате", "лелуш", "беренштейн", "тимошенко", "атаманов",
            "гиллермин", "харлин", "блие", "минкофф", "досталь",
            "бэ", "уир", "юнебель", "шахбазян", "кустурица",
            "паркер", "аллерс", "олтман", "полковников", "фетин",
            "добролюбов", "ханна", "цуцульковский", "астрахан", "бромберг",
            "мактирнан", "кохан", "лайман", "граник", "коэн",
            "ли", "симонов", "суслович", "шукшин", "спилберг",
            "файман", "воркман", "давидчук", "уайзмен", "ньюэлл",
            "ливанов", "уайлер", "борецкий", "клайзер", "подесва",
            "мур", "аронов", "форстер", "дьяченко", "шерфиг",
            "качанов", "кротенко", "чимино", "бендер", "егиазаров",
            "павловский", "вебер", "малкэхи", "робинсон", "левчук",
            "кёрран", "стрелков", "бойл", "лотнер", "мейерс",
            "дахно", "попов", "вербински", "любимов", "феста",
            "басов", "храмов", "кропачев", "уайлдер", "берри",
            "фултон", "ворличек", "кончаловский", "ханеке", "зонненфельд",
            "калик", "хармон", "шунько", "дарабонт"
    };

        public static HashMap<String, String> DirectorDictionary = new HashMap<>() {{
                put("рязан", "эльдар");
                put("гайда", "леонид");
                put("захар", "марк");
                put("ростоцк", "станисла");
                put("говорухин", "станисла");
                put("масленник", "игор");
                put("юнгвальд-хилькевич", "георг");
                put("дорма", "вениамин");
                put("фрид", "ян");
                put("бортк", "владимир");
                put("данел", "георг");
                put("суриков", "алл");
                put("бондарчук", "серг");
                put("лиознов", "татья");
                put("земекис", "роберт");
                put("вебер", "франсис");
                put("бык", "леонид");
                put("тарковск", "андр");
                put("чулюкин", "юр");
                put("павловск", "александр");
                put("швейцер", "миха");
                put("бромберг", "константин");
                put("татарск", "евген");
                put("меньш", "владимир");
                put("ур", "жерар");
                put("сер", "александр");
                put("козак", "миха");
                put("и", "кастелла");
                put("ташк", "евген");
                put("карел", "евген");
                put("мотыл", "владимир");
                put("ро", "александр");
                put("кубрик", "стэнл");
                put("рогожкин", "александр");
                put("квинихидз", "леонид");
                put("александр", "григор");
                put("молинар", "эдуар");
                put("кошеверов", "надежд");
                put("кеосая", "эдмонд");
                put("чухра", "григор");
                put("жир", "жан");
                put("калинин", "никола");
                put("фетин", "владимир");
                put("феллин", "федерик");
                put("балабан", "алекс");
                put("висконт", "лукин");
                put("михалк", "никит");
                put("шахназар", "кар");
                put("хуц", "марл");
                put("миронер", "феликс");
                put("пыр", "ива");
                put("джексон", "питер");
                put("гофма", "еж");
                put("проспер", "франк");
                put("рязан", "эльдар");
                put("юнебел", "андрэ");
                put("урсуляк", "серг");
                put("шукшин", "васил");
                put("робер", "ив");
                put("кастелла", "франк");
                put("мочч", "джузепп");
                put("вороб", "владимир");
                put("птушк", "александр");
                put("кэмерон", "джеймс");
                put("бертон", "тим");
                put("бежан", "геральд");
                put("клим", "эл");
                put("спилберг", "стив");
                put("коламбус", "крис");
                put("уск", "валер");
                put("краснопольск", "владимир");
                put("форма", "милош");
                put("корен", "алекс");
                put("форд", "фрэнсис");
                put("мельник", "витал");
                put("тутышкин", "андр");
                put("тимошенк", "сем");
                put("бирма", "наум");
                put("бертолучч", "бернард");
                put("махульск", "юлиуш");
                put("зид", "клод");
                put("калатоз", "миха");
                put("фон", "ларс");
                put("малюк", "андр");
                put("антонион", "микеланджел");
                put("ал", "александр");
                put("наум", "владимир");
                put("митт", "александр");
                put("финчер", "дэвид");
                put("герасим", "серг");
                put("рогов", "владимир");
                put("граник", "анатол");
                put("макар", "виктор");
                put("полынник", "александр");
                put("дружинин", "светла");
                put("корбер", "серж");
                put("бас", "владимир");
                put("скотт", "ридл");
                put("поланск", "рома");
                put("зарх", "александр");
                put("кустуриц", "эмир");
                put("прошкин", "александр");
                put("хитрук", "федор");
                put("сип", "рамеш");
                put("гибсон", "мэл");
                put("мурат", "александр");
                put("степан", "борис");
                put("никифор", "вячесла");
                put("иван", "геннад");
                put("фомин", "олег");
                put("цукер", "джерр");
                put("уайлер", "уил");
                put("поллак", "сидн");
                put("халльстр", "ласс");
                put("уразба", "эльдор");
                put("бэдэм", "джон");
                put("пирес", "жерар");
                put("ворличек", "вацла");
                put("гонсалес", "алехандр");
                put("коха", "григор");
                put("козинц", "григор");
                put("бергма", "ингмар");
                put("форер", "альфред");
                put("риз", "дин");
                put("рамис", "харольд");
                put("смирн", "андр");
                put("мкртчян", "альберт");
                put("поп", "леонид");
                put("оганеся", "генр");
                put("тарантин", "квентин");
                put("кошевер", "надежд");
                put("шапир", "миха");
                put("лапшин", "ярополк");
                put("храм", "виктор");
                put("плучек", "валентин");
                put("гаспар", "самвел");
                put("юнебел", "андр");
                put("кравчик", "жерар");
                put("жак", "кристиа");
                put("тиг", "льюис");
                put("вайншток", "владимир");
                put("корнелл", "джон");
                put("хичкок", "альфред");
                put("самсон", "самсон");
                put("бендер", "джек");
                put("уильямс", "стив");
                put("полок", "геннад");
                put("арсен", "павел");
                put("леон", "сердж");
                put("файма", "питер");
                put("казанск", "геннад");
                put("чеботар", "владимир");
                put("неча", "леонид");
                put("трегубович", "виктор");
                put("бондар", "олег");
                put("стоун", "оливер");
                put("ромм", "миха");
                put("корбучч", "сердж");
                put("воин", "константин");
                put("кончаловск", "андр");
                put("эмис", "джулиа");
                put("бессон", "люк");
                put("уайлдер", "билл");
                put("алл", "вуд");
                put("куросав", "акир");
                put("бордер", "бернар");
                put("ерш", "константин");
                put("кропач", "георг");
                put("птушк", "александр");
                put("эйзенштейн", "серг");
                put("энрик", "робер");
                put("чаплин", "чарл");
                put("казанск", "геннад");
                put("лукинск", "ива");
                put("лунгин", "павел");
                put("даннинг", "джордж");
                put("райкин", "аркад");
                put("храм", "виктор");
                put("тодоровск", "петр");
                put("бык", "рола");
                put("лотнер", "жорж");
                put("иван", "виктор");
                put("норштейн", "юр");
                put("юдин", "константин");
                put("дарабонт", "фрэнк");
                put("скорсез", "мартин");
                put("дзеффирелл", "франк");
                put("петерс", "вольфганг");
                put("маршалл", "гарр");
                put("паол", "пьер");
                put("корбучч", "сердж");
                put("кулиджан", "лев");
                put("флеминг", "виктор");
                put("кьюкор", "джордж");
                put("вуд", "сэм");
                put("дьяченк", "дмитр");
                put("шедьяк", "том");
                put("абдрашит", "вад");
                put("панфил", "глеб");
                put("бенин", "роберт");
                put("эдвардс", "блэйк");
                put("бигело", "кэтрин");
                put("файнциммер", "александр");
                put("иван", "александр");
                put("гусма", "юл");
                put("асанов", "динар");
                put("черкасск", "давид");
                put("лэнгтон", "саймон");
                put("азар", "вилл");
                put("кузовк", "олег");
                put("ужин", "олег");
                put("червяц", "денис");
                put("райзма", "юл");
                put("озер", "юр");
                put("равенск", "борис");
                put("лукашевич", "татья");
                put("достал", "никола");
                put("тутышкин", "андр");
                put("микаэля", "серг");
                put("цар", "миха");
                put("левин", "васил");
                put("херцог", "вернер");
                put("вербинск", "гор");
                put("рубинчик", "валер");
                put("коэн", "брат");
                put("юзовск", "миха");
                put("столпер", "александр");
                put("иван", "борис");
                put("шумахер", "джоэл");
                put("ивановск", "александр");
                put("кошеверов", "надежд");
                put("ковалевск", "инесс");
                put("белинск", "александр");
                put("тейлор", "ала");
                put("грейвз", "алекс");
                put("минаха", "даниэл");
                put("рич", "га");
                put("народицк", "абр");
                put("раше", "никола");
                put("рыцар", "борис");
                put("тит", "виктор");
                put("лук", "леонид");
                put("чхеидз", "рез");
                put("манкевич", "джозеф");
                put("котеночкин", "вячесла");
                put("раппапорт", "герберт");
                put("дер", "жак");
                put("атаман", "лев");
                put("хитрук", "федор");
                put("сокольск", "геннад");
                put("солов", "серг");
                put("ньюэлл", "майк");
                put("ли", "дже");
                put("абелевич", "рома");
                put("мингелл", "энтон");
                put("степанц", "борис");
                put("де", "филипп");
                put("аранович", "сем");
                put("дур", "борис");
                put("рошал", "григор");
                put("татарск", "александр");
                put("демм", "джоната");
                put("столпер", "александр");
                put("жар", "миха");
                put("грошопп", "рихард");
                put("де", "лу");
                put("леман", "майкл");
                put("крамер", "стэнл");
                put("хэкфорд", "тэйлор");
                put("уир", "питер");
                put("сидел", "серг");
                put("бровкин", "вячесла");
                put("кротенк", "юр");
                put("павл", "геннад");
                put("давидчук", "васил");
                put("джармуш", "джим");
                put("назар", "эдуард");
                put("назар", "владимир");
                put("файз", "джаник");
                put("козинц", "григор");
                put("трауберг", "леонид");
                put("кита", "такеш");
                put("нола", "кристофер");
                put("левинсон", "ричард");
                put("линк", "уил");
                put("давыд", "рома");
                put("шепитьк", "ларис");
                put("де", "виттор");
                put("попк", "владимир");
                put("вендерс", "вим");
                put("уинсер", "саймон");
                put("бурц", "александр");
                put("макар", "ил");
                put("вассербаум", "миха");
                put("музык", "юр");
                put("фокин", "владимир");
                put("литус", "никола");
                put("мишурин", "алекс");
                put("матве", "евген");
                put("куарон", "альфонс");
                put("поп", "владимир");
                put("ус", "игор");
                put("родригес", "оберт");
                put("деревянск", "сем");
                put("суслович", "рафа");
                put("тертелтауб", "джон");
                put("брест", "мартин");
                put("оз", "фрэнк");
                put("стрейч", "янис");
                put("хейфиц", "иосиф");
                put("ардолин", "эмил");
                put("кэмпбелл", "мартин");
                put("мейерс", "нэнс");
                put("лелуш", "клод");
                put("вачовск", "лан");
                put("вачовск", "лилл");
                put("рауш", "ирм");
                put("гидройк", "кок");
                put("курихин", "никит");
                put("вульфович", "теодор");
                put("кремн", "валер");
                put("дербен", "вад");
                put("бунюэл", "луис");
                put("левинсон", "барр");
                put("балая", "рома");
                put("уэллс", "орсон");
                put("скотт", "тон");
                put("паркер", "ала");
                put("гиллермин", "джон");
                put("егиазар", "гавр");
                put("храбровицк", "дан");
                put("торнатор", "джузепп");
                put("ивченк", "виктор");
                put("герма", "алекс");
                put("кулиш", "савв");
                put("линч", "дэвид");
                put("райтма", "айва");
                put("бренч", "алоиз");
                put("добролюб", "игор");
                put("аркуш", "алла");
                put("уайзм", "сэм");
                put("перр", "джералд");
                put("петр", "владимир");
                put("цуцульковск", "лев");
                put("о'коннор", "пэт");
                put("фрирз", "стив");
                put("кисел", "дмитр");
                put("лукашевич", "татья");
                put("ромм", "миха");
                put("васил", "дмитр");
                put("мишел", "андр");
                put("аронофск", "дарр");
                put("герасим", "владимир");
                put("литус", "никола");
                put("шуньк", "витал");
                put("эйсымонт", "виктор");
                put("бартлетт", "холл");
                put("серге", "виктор");
                put("мкртчян", "альберт");
                put("кэмпион", "джейн");
                put("де", "брайа");
                put("анненск", "исидор");
                put("райт", "джо");
                put("карасик", "юл");
                put("дем", "жак");
                put("стэнтон", "эндр");
                put("ройзма", "зинов");
                put("гриффитс", "марк");
                put("хайерс", "сидн");
                put("столб", "александр");
                put("любим", "павел");
                put("звягинц", "андр");
                put("шипенк", "клим");
                put("жен", "жан-пьер");
                put("филат", "леонид");
                put("матисон", "ан");
                put("юра", "ната");
                put("бас", "владимир");
                put("басов", "ольг");
                put("бабич", "искр");
                put("софтл", "иэн");
                put("хуц", "марл");
                put("байсак", "геннад");
                put("хенкел", "флориа");
                put("кар", "юр");
                put("бэ", "майкл");
                put("эммер", "роланд");
                put("маршалл", "роб");
                put("жебрюнас", "арунас");
                put("ман", "майкл");
                put("рафелсон", "боб");
                put("никифор", "вячесла");
                put("гурин", "ил");
                put("птушк", "александр");
                put("вятич-бережн", "дамир");
                put("пудовкин", "всеволод");
                put("доллер", "миха");
                put("хиллер", "артур");
                put("плучек", "валентин");
                put("арон", "григор");
                put("иванович", "никола");
                put("яса", "эрнес");
                put("галин", "александр");
                put("бланк", "александр");
                put("линк", "серг");
                put("фрол", "андр");
                put("жанс", "ксав");
                put("разенк", "андр");
                put("ховард", "рон");
                put("ивановск", "александр");
                put("росселлин", "роберт");
                put("чухра", "павел");
                put("смит", "кевин");
                put("ашкеназ", "серг");
                put("ву", "джон");
                put("сахар", "алекс");
                put("кассаветис", "ник");
                put("липшиц", "григор");
                put("резник", "анатол");
                put("бойл", "дэн");
                put("гилл", "терр");
                put("праздник", "алекс");
                put("басин", "серг");
                put("капиц", "кирилл");
                put("месх", "дмитр");
                put("тодоровск", "валер");
                put("боржив", "зема");
                put("дамиан", "дамиа");
                put("ванчин", "флореста");
                put("перелл", "луидж");
                put("накаш", "олив");
                put("толеда", "эрик");
                put("котт", "александр");
                put("верхов", "пол");
                put("ахад", "валер");
                put("бобровск", "анатол");
                put("рейнолдс", "кевин");
                put("фоменк", "петр");
                put("ратнер", "бретт");
                put("аменабар", "алехандр");
                put("ван", "гас");
                put("фрэнкел", "дэвид");
                put("мамин", "юр");
                put("аллерс", "роджер");
                put("минкофф", "роб");
                put("магуаер", "шэрон");
                put("меликя", "ан");
                put("роббинс", "тим");
                put("эфрон", "нор");
                put("ордынск", "васил");
                put("агранович", "миха");
                put("янковск", "олег");
                put("маршалл", "гэрр");
                put("снежко-блоцк", "александр");
                put("ливан", "васил");
                put("зябликов", "аид");
                put("лебед", "никола");
                put("мат", "рудольф");
                put("стрелк", "владимир");
                put("какояннис", "михалис");
                put("субхаш", "баббар");
                put("мэдд", "джон");
                put("херсковиц", "маршалл");
                put("борецк", "юр");
                put("полковник", "владимир");
                put("снежко-блоцк", "александр");
                put("рыбар", "валер");
                put("апася", "игор");
                put("франчиш", "пьетр");
                put("керра", "джон");
                put("пархоменк", "павел");
                put("малкэх", "рассел");
                put("коппол", "соф");
                put("фарелл", "брат");
                put("беренштейн", "владимир");
                put("гурин", "ил");
                put("лук", "леонид");
                put("клема", "рен");
                put("барбер", "джозеф");
                put("хан", "уил");
                put("исинг", "рудольф");
                put("ильинск", "игор");
                put("саак", "юр");
                put("лив", "джер");
                put("иван", "витал");
                put("жар", "миха");
                put("миллер", "джордж");
                put("нугман", "рашид");
                put("фест", "паскуал");
                put("джорда", "нил");
                put("вад", "рож");
                put("шенгел", "георг");
                put("лэндис	", "джон");
                put("муратов", "кир");
                put("долдр", "стив");
                put("бергер", "нейл");
                put("бланк", "александр");
                put("андерсон", "линдс");
                put("хотиненк", "владимир");
                put("демм", "тед");
                put("робинсон", "брюс");
                put("олег", "тепц");
                put("зонненфельд", "барр");
                put("фосс", "боб");
                put("фрэз", "ил");
                put("чеботар", "владимир");
                put("боголюб", "александр");
                put("альмодовар", "педр");
                put("эфрос", "анатол");
                put("кьюкор", "джордж");
                put("лайма", "даг");
                put("буне", "борис");
                put("праздник", "алекс");
                put("кауфма", "филипп");
                put("ан", "жан-жак");
                put("зейтун", "ариэл");
                put("бресс", "эрик");
                put("ян", "томас");
                put("озон", "франсу");
                put("чечик", "джеремай");
                put("уэллер", "питер");
                put("лин", "джоната");
                put("мактирна", "джон");
                put("иванов-ва", "ива");
                put("бутак", "борис");
                put("черн", "денис");
                put("пичул", "васил");
                put("кеосая", "тигра");
                put("аугуст", "билл");
                put("трахтенберг", "наум");
                put("джерм", "пьетр");
                put("мэннерс", "ким");
                put("боум", "роб");
                put("наттер", "дэвид");
                put("лотян", "эмил");
                put("франкенхаймер", "джон");
                put("кепп", "дэвид");
                put("депп", "джон");
                put("астраха", "дмитр");
                put("костнер", "кевин");
                put("форстер", "марк");
                put("данел", "георг");
                put("таланкин", "игор");
                put("йейтс", "дэвид");
                put("миядзак", "хая");
                put("найт", "м.");
                put("колос", "серг");
                put("клушанц", "павел");
                put("иствуд", "клинт");
                put("маллига", "роберт");
                put("брукс", "джеймс");
                put("персива", "брайа");
                put("гейл", "боб");
                put("жалакявичюс", "витаутас");
                put("данмор", "лоуренс");
                put("таланкин", "игор");
                put("рассел", "чак");
                put("пен", "артур");
                put("херрингтон", "роуд");
                put("бран", "кеннет");
                put("степан", "борис");
                put("брукс", "ричард");
                put("кэзда", "лоуренс");
                put("василевск", "радомир");
                put("туман", "сем");
                put("хьюз", "альберт");
                put("хьюз", "алл");
                put("берр", "клод");
                put("стеллинг", "йос");
                put("виник", "гар");
                put("гринуэ", "питер");
                put("хазанавичус", "мишел");
                put("довган", "владимир");
                put("николс", "майк");
                put("фонт", "ан");
                put("наир", "мир");
                put("леконт", "патрис");
                put("капур", "шекхар");
                put("пружанск", "ефр");
                put("жофф", "роланд");
                put("кидрон", "биба");
                put("маршалл", "пен");
                put("арка", "ден");
                put("орл", "марк");
                put("сега", "моха");
                put("оганеся", "кар");
                put("худяк", "константин");
                put("гонзалез", "фернанд");
                put("мегердич", "антон");
                put("клайзер", "рэнда");
                put("ардашник", "наум");
                put("ефрем", "олег");
                put("новак", "вилл");
                put("гре", "виктор");
                put("егор", "юр");
                put("поттер", "салл");
                put("вачовск", "дуэт");
                put("тыквер", "том");
                put("адамсон", "эндр");
                put("дженсон", "вик");
                put("рэвич", "рэнд");
                put("андерс", "элисон");
                put("рокуэлл", "александр");
                put("родригес", "роберт");
                put("тарантин", "квентин");
                put("руф", "макс");
                put("игоревич", "никола");
                put("джонстон", "джо");
                put("бычк", "владимир");
                put("протазан", "як");
                put("паркер", "оливер");
                put("агрест", "алехандр");
                put("дамиан", "дамиа");
                put("каза", "эл");
                put("экк", "никола");
                put("абал", "эдуард");
                put("юис", "джейм");
                put("бентон", "роберт");
                put("аленик", "владимир");
                put("гондр", "мишел");
                put("маккуин", "стив");
                put("соммерс", "стив");
                put("дженнингс", "гарт");
                put("андерсон", "пол");
                put("лурма", "баз");
                put("нойс", "филипп");
                put("чимин", "майкл");
                put("дубровин", "юр");
                put("содерберг", "стив");
                put("кертис", "ричард");
                put("нахапет", "родион");
                put("грамматик", "владимир");
                put("евлахишв", "серг");
                put("петр", "александр");
                put("салтык", "алекс");
                put("виктор", "ричард");
                put("мирошниченк", "серг");
                put("гайда", "леонид");
                put("орк", "рист");
                put("андерсон", "уэс");
                put("лейманис", "александр");
                put("шерфиг", "лон");
                put("ли", "энг");
                put("сальч", "луча");
                put("парент", "нер");
                put("сокур", "александр");
                put("воркма", "чак");
                put("муччин", "габриэл");
                put("хармон", "роберт");
                put("саб", "иштва");
                put("доннелл", "киара");
                put("подесв", "джерем");
                put("уолш", "дирбл");
                put("мэннерс", "ким");
                put("коркора", "билл");
                put("уитмор", "джеймс");
                put("качан", "рома");
                put("эптид", "майкл");
                put("култер", "алл");
                put("по", "ала");
                put("каурисмяк", "мик");
                put("фултон", "кит");
                put("пеп", "луис");
                put("таланкин", "игор");
                put("таланкин", "дмитр");
                put("уорд", "винсент");
                put("иванов-ва", "ива");
                put("снежко-блоцк", "александр");
                put("николс", "майк");
                put("вайд", "андж");
                put("линч", "дэвид");
                put("фрост", "марк");
                put("уайз", "роберт");
                put("дьюк", "дэр");
                put("литус", "никола");
                put("симоненк", "ива");
                put("шнабел", "юлиа");
                put("дел", "гильерм");
                put("иванов-ва", "ива");
                put("мильчин", "лев");
                put("доннер", "ричард");
                put("харлин", "рен");
                put("варн", "режис");
                put("бурм", "джон");
                put("никкол", "эндр");
                put("бардин", "гарр");
                put("сторожев", "вер");
                put("ольшвангер", "ил");
                put("лайн", "эдриа");
                put("кулиджан", "лев");
                put("сегел", "як");
                put("мактиг", "джеймс");
                put("о'брайэн", "джим");
                put("кертис", "майкл");
                put("цехановск", "миха");
                put("эрма", "джон");
                put("хупер", "том");
                put("довлатя", "фрунз");
                put("мирск", "лев");
                put("блэр", "дэвид");
                put("поп", "владимир");
                put("хэнсон", "кертис");
                put("райнер", "роб");
                put("хэнд", "дэвид");
                put("грен", "ната");
                put("ховард", "байрон");
                put("уотерс", "джон");
                put("хаггис", "пол");
                put("шахмалиев", "ая");
                put("приемых", "валер");
                put("лассетер", "джон");
                put("кершброн", "жан");
                put("лукас", "джордж");
                put("каурисмяк", "ак");
                put("голуб", "лев");
                put("георг", "виктор");
                put("стиллер", "бен");
                put("сингер", "брайа");
                put("паркер", "тре");
                put("стоун", "мэтт");
                put("адамсон", "эндр");
                put("лайн", "эдриа");
                put("ханек", "михаэл");
                put("ван", "жак");
                put("петрухин", "федор");
                put("ишмухамед", "эльер");
                put("кроман", "григор");
                put("чхан", "пак");
                put("дахн", "владимир");
                put("итыгил", "александр");
                put("томас", "пол");
                put("малик", "терренс");
                put("селезнев", "инесс");
                put("сукач", "гарик");
                put("миллер", "фрэнк");
                put("родригес", "роберт");
                put("тарантин", "квентин");
                put("злoбин", "вад");
                put("opлoв", "mapк");
                put("пчeлкин", "лeoнид");
                put("аббас", "шухрат");
                put("барщевск", "антон");
                put("мур", "майкл");
                put("эгоя", "ат");
                put("рэ", "николас");
                put("говорухин", "станисла");
                put("дур", "борис");
                put("макнотон", "джон");
                put("шор", "дэвид");
                put("летер", "лу");
                put("о'хенлон", "джим");
                put("маршалл", "фрэнк");
                put("бабая", "агас");
                put("дежкин", "борис");
                put("олтма", "роберт");
                put("калатозишв", "георг");
                put("васил", "геннад");
                put("калик", "миха");
                put("цвик", "эдвард");
                put("ледер", "мим");
                put("нишимур", "киес");
                put("солов", "серг");
                put("бычков", "окса");
                put("хаф", "джон");
                put("рифенштал", "лен");
                put("трусдейл", "гэр");
                put("бли", "бертра");
                put("тарас", "серг");
                put("майкл", "джон");
                put("лоуренс", "фрэнсис");
                put("шамш", "болотбек");
                put("буне", "борис");
                put("данилин", "серг");
                put("татарск", "евген");
                put("лагравенес", "ричард");
                put("федоров", "мар");
                put("линклейтер", "ричард");
                put("сандерс", "крис");
                put("деблу", "дин");
                put("трюфф", "франсу");
                put("хажкасим", "хаса");
                put("иванович", "никола");
                put("букре", "борис");
                put("ульян", "миха");
                put("иванов-ва", "ива");
                put("жак", "люк");
                put("аравин", "александр");
                put("македонск", "владимир");
                put("зэфф", "дэн");
                put("манд", "марк");
                put("адамек", "витольд");
                put("шахбазя", "сур");
                put("миронер", "феликс");
                put("фуку", "антуа");
                put("сидор", "алекс");
                put("стаменкович", "мик");
                put("кун", "ян");
                put("левчук", "тимоф");
                put("ерш", "константин");
                put("сафра", "генр");
                put("машк", "владимир");
                put("гинзбург", "серг");
                put("карсон", "дэвид");
                put("уайз", "херберт");
                put("симон", "алекс");
                put("швайгер", "тил");
                put("пронин", "васил");
                put("аббас", "ходж");
                put("хилл", "уолтер");
                put("кустуриц", "эмир");
                put("ли", "спайк");
                put("ву", "джон");
                put("скотт", "ридл");
                put("яковл", "андр");
                put("гре", "ан");
                put("зобин", "вад");
                put("картер", "крис");
        }};

    public static HashMap<String, String> SynonymDictionary = new HashMap<>() {{
        put("советск", "ссср");
        put("отечествен", "россия");
        put("наш", "россия");
        put("американск", "сша");
        put("британск", "великобритания");
        put("английск", "великобритания");
        put("мультик", "мультфильм");
        put("мульт", "мультфильм");
        put("воен", "военный");
        put("комед", "комедия");
        put("нов", "новый");
        put("стар", "старый");
        put("хорош", "хороший");
        put("плох", "плохой");
        put("немецк", "германия");
        put("семейн", "семейный");
        put("французск", "франция");
    }};
}