package Database.MovieRepository;

public class DataBaseOfMovie {
    //пук пук
    public static String[] CategoryArray = new String[]{
            "Фильм", "Сериал", "Короткометражка"
    };

    public static String[] DirectorArray = new String[]{
            "Вуди Аллен", "Гай Ричи", "Гильермо дель Торо",
            "Даррен Аронофски", "Джеймс Кэмерон",
            "Джеймс Кэмерон", "Джон Фавро", "Джоэл Коэн",
            "Джудд Апатоу", "Дэвид Финчер", "Дэнни Бойл",
            "Зак Снайдер", "Итан Коэн", "Квентин Тарантино",
            "Клинт Иствуд", "Кристофер Нолан", "Майкл Манн",
            "Мартин Скорсезе", "Педро Альмодовар", "Питер Джексон",
            "Пол Гринграсс", "Пол Томас Андерсон", "Ридли Скотт",
            "Рон Ховард", "Стивен Спилберг", "Стивен Содерберг",
            "Сэм Рейми", "Тим Бертон", "Фрэнк Дарабонт",
            "Хаяо Миядзаки", "Энг Ли"
    };

    public static String[] CountryArray = new String[]{
            "Россия", "СССР", "США",
            "Франция", "Южная Корея", "Великобритания",
            "Япония", "Италия", "Испания",
            "Германия", "Турция", "Швеция",
            "Дания", "Норвегия", "Гонконг",
            "Австралия", "Бельгия", "Нидерланды",
            "Греция", "Австрия"
    };

    public static String[] GenreArray = new String[]{
            "Комедия", "Мультфильм", "Ужасы",
            "Фантастика", "Триллер", "Боевик",
            "Мелодрама", "Детектив", "Приключения",
            "Фэнтези", "Военный", "Семейный",
            "Аниме", "Исторический", "Драма",
            "Документальный", "Детский", "Криминал",
            "Биография", "Вестерн", "Фильм-нуар",
            "Спорт", "Реальное", "ТВ",
            "Концерт", "Музыка", "Мюзикл",
            "Ток-шоу", "Новости", "Игра", "Церемония"
    };
}
