package Database.MovieRepository;

public class MovieArray {

    public static Movie[] movieRepositoryArray = new Movie[] {
            new Movie(
                    "Унесённые призраками",
                    "Аниме",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Ходячий замок",
                    "Аниме",
                    "Полнометражка",
                    2004,
                    "Япония",
                    8.3,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Твоё имя",
                    "Аниме",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Зелёная книга",
                    "Биография",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Поймай меня, если сможешь",
                    "Криминал",
                    "Полнометражка",
                    2002,
                    "США",
                    8.5,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Начало",
                    "Фантастика",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Брат 2",
                    "Боевик",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джанго освобожденный",
                    "Вестерн",
                    "Полнометражка",
                    2012,
                    "США",
                    8.2,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Омерзительная восьмерка",
                    "Вестерн",
                    "Полнометражка",
                    2015,
                    "США",
                    7.9,
                    "Квентин Тарантино"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "В бой идут одни \"старики\"",
                    "Военный",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.7,
                    "Леонид Быков"
            ),
            new Movie(
                    "Пианист",
                    "Военный",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Спасти рядового Райана",
                    "Военный",
                    "Полнометражка",
                    1998,
                    "США",
                    8.2,
                    "Стивен Спилберг"
            ),
            new Movie(
                    "Остров проклятых",
                    "Детектив",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Достать ножи",
                    "Детектив",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Шерлок",
                    "Детектив",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Детский",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Детский",
                    "Мультсериал",
                    2003,
                    "Россия",
                    7.3,
                    "Илья Попов"
            ),
            new Movie(
                    "Фиксики",
                    "Детский",
                    "Мультсериал",
                    2010,
                    "Россия",
                    6.9,
                    "Василий Бедошвили"
            ),
            new Movie(
                    "Романовы",
                    "Документальный",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "Документальный",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Следствие вели",
                    "Документальный",
                    "Сериал",
                    2006,
                    "Россия",
                    7.9,
                    "Дмитрий Докучаев"
            ),
            new Movie(
                    "Зелёная книга",
                    "Драма",
                    "Полнометражка",
                    2018,
                    "США",
                    8.4,
                    "Питер Фаррелли"
            ),
            new Movie(
                    "Игры разума",
                    "Драма",
                    "Полнометражка",
                    2001,
                    "США",
                    8.6,
                    "Рон Ховард"
            ),
            new Movie(
                    "Остров проклятых",
                    "Драма",
                    "Полнометражка",
                    2009,
                    "США",
                    8.5,
                    "Мартин Скорсезе"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Игра",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Игра",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Игра",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Романовы",
                    "История",
                    "Сериал",
                    2013,
                    "Россия",
                    8.9,
                    "Максим Беспалый"
            ),
            new Movie(
                    "Великая война",
                    "История",
                    "Сериал",
                    2010,
                    "Россия",
                    8.8,
                    "Анна Граждан"
            ),
            new Movie(
                    "Титаник",
                    "История",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Джентельмены",
                    "Комедия",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Комедия",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Бриллиантовая рука",
                    "Комедия",
                    "Полнометражка",
                    1968,
                    "СССР",
                    8.5,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Короткометражка",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Самогонщики",
                    "Короткометражка",
                    "Короткометражка",
                    1962,
                    "СССР",
                    8.3,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Наваждение",
                    "Короткометражка",
                    "Короткометражка",
                    1965,
                    "СССР",
                    8.8,
                    "Леонид Гайлай"
            ),
            new Movie(
                    "Джентельмены",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "Великобритания",
                    8.5,
                    "Гай Ричи"
            ),
            new Movie(
                    "Брат 2",
                    "Криминал",
                    "Полнометражка",
                    2000,
                    "Россия",
                    8.1,
                    "Алексей Балабанов"
            ),
            new Movie(
                    "Достать ножи",
                    "Криминал",
                    "Полнометражка",
                    2019,
                    "США",
                    8.0,
                    "Райан Джонсон"
            ),
            new Movie(
                    "Твоё имя",
                    "Мелодрама",
                    "Полнометражка",
                    2016,
                    "Япония",
                    8.3,
                    "Макото Синкай"
            ),
            new Movie(
                    "Титаник",
                    "Мелодрама",
                    "Полнометражка",
                    1997,
                    "США",
                    8.4,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Друзья",
                    "Мелодрама",
                    "Сериал",
                    1994,
                    "США",
                    9.2,
                    "Гари Хэлворсон"
            ),
            new Movie(
                    "Пианист",
                    "Музыка",
                    "Полнометражка",
                    2002,
                    "Франция",
                    8.5,
                    "Роман Полански"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Музыка",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэмьен Шазелл"
            ),
            new Movie(
                    "Трое из Простоквашино",
                    "Мультфильм",
                    "Короткометражка",
                    1978,
                    "СССР",
                    8.8,
                    "Владимир Попов"
            ),
            new Movie(
                    "Смешарики",
                    "Мультфильм",
                    "Сериал",
                    2003,
                    "Россия",
                    7.3,
                    "Денис Чернов"
            ),
            new Movie(
                    "Холодное сердце",
                    "Мультфильм",
                    "Полнометражка",
                    2013,
                    "США",
                    7.8,
                    "Крис Бак"
            ),
            new Movie(
                    "Алладин",
                    "Мюзикл",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Ла-Ла Ленд",
                    "Мюзикл",
                    "Полнометражка",
                    2016,
                    "США",
                    7.9,
                    "Дэиьен Шазелл"
            ),
            new Movie(
                    "Кошмар перед Рождеством",
                    "Мюзикл",
                    "Полнометражка",
                    1993,
                    "США",
                    8.0,
                    "Генри Селик"
            ),
            new Movie(
                    "Выживший",
                    "Приключения",
                    "Полнометражка",
                    2015,
                    "США",
                    7.8,
                    "Алехандро Гонсалес Иньярриту"
            ),
            new Movie(
                    "Иван Васильевич меняет профессию",
                    "Приключения",
                    "Полнометражка",
                    1973,
                    "СССР",
                    8.8,
                    "Леонид Гайдай"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Приключения",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Топ-модель по-американски",
                    "Реальное ТВ",
                    "Сериал",
                    2003,
                    "США",
                    7.4,
                    "Тони Кролл"
            ),
            new Movie(
                    "Проект Подиум",
                    "Реальное ТВ",
                    "Сериал",
                    2004,
                    "США",
                    7.8,
                    "Крэйг Спирко"
            ),
            new Movie(
                    "Адская кухня",
                    "Реальное ТВ",
                    "Сериал",
                    2005,
                    "США",
                    7.3,
                    "Марк В. Роден"
            ),
            new Movie(
                    "Алладин",
                    "Семейный",
                    "Полнометражка",
                    2019,
                    "США",
                    7.3,
                    "Гай Ричи"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Семейный",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Семейный",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Начало",
                    "Триллер",
                    "Полнометражка",
                    2010,
                    "США",
                    8.7,
                    "Кристофер Нолан"
            ),
            new Movie(
                    "Шерлок",
                    "Триллер",
                    "Сериал",
                    2010,
                    "Великобритания",
                    8.9,
                    "Пол МакГиган"
            ),
            new Movie(
                    "Аватар",
                    "Фантастика",
                    "Полнометражка",
                    2009,
                    "США",
                    7.9,
                    "Джеймс Кэмерон"
            ),
            new Movie(
                    "Унесённые призраками",
                    "Фэнтези",
                    "Полнометражка",
                    2001,
                    "Япония",
                    8.4,
                    "Хаяо Миядзаки"
            ),
            new Movie(
                    "Рапунцель: запутанная история",
                    "Фэнтези",
                    "Полнометражка",
                    2010,
                    "США",
                    7.9,
                    "Нэйтан Грено"
            ),
            new Movie(
                    "Чарли и шоколадная фабрика",
                    "Фэнтези",
                    "Полнометражка",
                    2005,
                    "США",
                    7.6,
                    "Тим Бёртон"
            )
    };
}
